{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [],
  "normalizer": null,
  "pre_tokenizer": null,
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "vocab": {
      "#": 0,
      "%": 1,
      "(": 2,
      ")": 3,
      "+": 4,
      "-": 5,
      ".": 6,
      "/": 7,
      "0": 8,
      "1": 9,
      "2": 10,
      "3": 11,
      "4": 12,
      "5": 13,
      "6": 14,
      "7": 15,
      "8": 16,
      "9": 17,
      "=": 18,
      "@": 19,
      "A": 20,
      "B": 21,
      "C": 22,
      "F": 23,
      "H": 24,
      "I": 25,
      "K": 26,
      "L": 27,
      "M": 28,
      "N": 29,
      "O": 30,
      "P": 31,
      "R": 32,
      "S": 33,
      "T": 34,
      "X": 35,
      "Z": 36,
      "[": 37,
      "\\": 38,
      "]": 39,
      "a": 40,
      "b": 41,
      "c": 42,
      "e": 43,
      "g": 44,
      "i": 45,
      "l": 46,
      "n": 47,
      "o": 48,
      "p": 49,
      "r": 50,
      "s": 51,
      "t": 52,
      "cc": 53,
      "CC": 54,
      "O)": 55,
      "=O)": 56,
      "C(": 57,
      "c1": 58,
      "c(": 59,
      "c2": 60,
      "H]": 61,
      "[C": 62,
      "[C@": 63,
      "C)": 64,
      "C(=O)": 65,
      "c1cc": 66,
      "c3": 67,
      "H](": 68,
      "c2cc": 69,
      "[C@@": 70,
      ")cc": 71,
      "(=O)": 72,
      "(C)": 73,
      "C(=O)N": 74,
      "CCCC": 75,
      "CN": 76,
      "[C@H](": 77,
      "c1ccc(": 78,
      "F)": 79,
      "c3cc": 80,
      "2)": 81,
      "[C@@H](": 82,
      "CO": 83,
      "NC(=O)": 84,
      "C1": 85,
      "Cl": 86,
      "c1cccc": 87,
      "cn": 88,
      "c2cccc": 89,
      "N)": 90,
      "c4": 91,
      ")cc1": 92,
      "CCN": 93,
      "[C@H]": 94,
      "=C(": 95,
      "3)": 96,
      "[C@@H]": 97,
      "n1": 98,
      "c2ccccc2": 99,
      "[n": 100,
      "c2ccc(": 101,
      "nc(": 102,
      "C2": 103,
      "c1ccccc1": 104,
      "C(C)": 105,
      "[nH]": 106,
      "CC1": 107,
      "c3cccc": 108,
      "CC(=O)": 109,
      "CCO": 110,
      "S(=O)": 111,
      "(F)": 112,
      "O=C(": 113,
      "S(=O)(=O)": 114,
      "CCN(": 115,
      "=C": 116,
      "Cl)": 117,
      "OC)": 118,
      "cccc": 119,
      "CC(C)": 120,
      "c3ccccc3": 121,
      "c1cc(": 122,
      "n2": 123,
      "CCCN": 124,
      "cc(": 125,
      "[C@H]1": 126,
      "C(F)": 127,
      "cc1": 128,
      "c1n": 129,
      "c2c(": 130,
      "c3ccc(": 131,
      "CCC": 132,
      "[C@@H]1": 133,
      "C(F)(F)": 134,
      "(C": 135,
      "/C": 136,
      "OC": 137,
      "+]": 138,
      "C(=O)N[C@@H](": 139,
      "CC(=O)N": 140,
      "F)cc": 141,
      "c2)": 142,
      "NC(=O)[C@H](": 143,
      "c2ccccc2)": 144,
      "[C@]": 145,
      "-]": 146,
      "c2n": 147,
      "4)": 148,
      "Cc1ccc(": 149,
      "c(=O)": 150,
      "(O)": 151,
      "Cl)cc": 152,
      "=O": 153,
      ")N": 154,
      "COc1ccc(": 155,
      "2)cc1": 156,
      "=C/": 157,
      "C(=O)O)": 158,
      "[N": 159,
      "c1cccc(": 160,
      "[O": 161,
      "[O-]": 162,
      "[C@@]": 163,
      "[C@H]2": 164,
      "[C@@H]2": 165,
      "c2cc(": 166,
      "c(-": 167,
      "C(=": 168,
      "Cc1": 169,
      "Br": 170,
      "c1)": 171,
      "[N+]": 172,
      "C3": 173,
      "c5": 174,
      "CCC(": 175,
      "c4cccc": 176,
      "CC2)": 177,
      "c1ccccc1)": 178,
      "O=": 179,
      "N2": 180,
      "CC(": 181,
      "C(=O)O": 182,
      "[C@H](O)": 183,
      "C(C)(C)": 184,
      "c3c(": 185,
      "[C@@H](O)": 186,
      "CO)": 187,
      "ccc(": 188,
      "=N": 189,
      "nc(-": 190,
      "c3)": 191,
      "/C=C/": 192,
      "c3ccccc3)": 193,
      "1)": 194,
      "nn": 195,
      "cs": 196,
      "N1": 197,
      "c2c1": 198,
      "O=C(N": 199,
      "CC2": 200,
      "C#": 201,
      "[C@@H](C)": 202,
      "c(C)": 203,
      "CN1": 204,
      "3)cc": 205,
      "CS": 206,
      "c[nH]": 207,
      "N)=O)": 208,
      "[C@H](C)": 209,
      "C(F)(F)F)": 210,
      "c4ccccc4": 211,
      "(=O)[O-]": 212,
      "[N+](=O)[O-]": 213,
      "C(C)C)": 214,
      "cc2": 215,
      "CN(": 216,
      "C2)": 217,
      "Cc1cc": 218,
      "c12": 219,
      "CC)": 220,
      "CCCCCCCC": 221,
      "CNC(=O)": 222,
      "CC3)": 223,
      "[C@H]3": 224,
      "COC(=O)": 225,
      "C(=O)N1": 226,
      "C[C@H](": 227,
      "O=C(O)": 228,
      "(-": 229,
      "c(N": 230,
      "c3n": 231,
      "[C@@H]3": 232,
      "c(O)": 233,
      "2)c1": 234,
      "nc(N": 235,
      "Cn1": 236,
      "CN(C)": 237,
      "c(OC)": 238,
      "C(=N)": 239,
      "S(=O)(=O)N": 240,
      "CC(C)C)": 241,
      "n3": 242,
      "c2cn": 243,
      "COc1cc(": 244,
      "C(C)=O)": 245,
      "/N": 246,
      "CC[C@]": 247,
      "C=": 248,
      "Cl)cc1": 249,
      "F)cc1": 250,
      "c2cccc(": 251,
      "c1ccc(-": 252,
      "OC(=O)": 253,
      "c4ccc(": 254,
      "c1ccc2c(": 255,
      "(C)C)": 256,
      "Cc1cc(": 257,
      "co": 258,
      "2)CC1": 259,
      "c1cc2": 260,
      "nc2": 261,
      "c1cn": 262,
      "CCN1": 263,
      "O=C1": 264,
      "c(Cl)": 265,
      "C1=O": 266,
      "NC(=O)[C@@H](": 267,
      "CN2": 268,
      "C(=O)N2": 269,
      "nc1": 270,
      "cc3": 271,
      "CC(C)(C)": 272,
      "Cc1ccccc1)": 273,
      "CCOC(=O)": 274,
      "4)cc": 275,
      "Cc1n": 276,
      "C[C@@H](": 277,
      "c3cc(": 278,
      "=C\\": 279,
      "Br)": 280,
      "Cc1ccccc1": 281,
      "C3)": 282,
      "C(C)(C)C)": 283,
      "(CC": 284,
      "c2ccc(Cl)cc": 285,
      "C(=N)N)": 286,
      "cc2)": 287,
      ")N1": 288,
      "O)cc1": 289,
      "/C(": 290,
      "P(=O)": 291,
      "cc(-": 292,
      "C(=O)N[C@H](": 293,
      "CCN(C(=O)": 294,
      "C(F)(F)F)cc": 295,
      "CC(=O)O)": 296,
      "C(N)=O)": 297,
      ".Cl": 298,
      "c23)": 299,
      "OCC": 300,
      "ncn": 301,
      "5)": 302,
      "C[C@@H]1": 303,
      "CCCNC(=N)N)": 304,
      "NC(=O)N": 305,
      "C[C@H]1": 306,
      "[O-])": 307,
      "CCCCN)": 308,
      "CCCCC1": 309,
      "c1O": 310,
      "C#N)": 311,
      "c1ccc2c(c1)": 312,
      "3)cc1": 313,
      "[N+](=O)[O-])": 314,
      "n2)": 315,
      "O[C@H](": 316,
      "N(": 317,
      "c2ccc(F)cc": 318,
      "(=O)=O)": 319,
      "[n+]": 320,
      "o1": 321,
      "c1c(": 322,
      "12": 323,
      "Cc2ccccc2)": 324,
      "CC1)": 325,
      "c4cc": 326,
      "N#": 327,
      "OCO": 328,
      "s1": 329,
      "c1nc(": 330,
      "c2nc(": 331,
      "c2)cc1": 332,
      "c(=O)[nH]": 333,
      "[C@@]2": 334,
      "c1ccc(Cl)cc1": 335,
      ")cc2": 336,
      "c(F)": 337,
      "CCCN1": 338,
      "(C)CC": 339,
      "n2)cc1": 340,
      "cn1": 341,
      "n(C)": 342,
      "n(": 343,
      "NS(=O)(=O)": 344,
      "C(O)": 345,
      "C2=O)": 346,
      "c2ccc(-": 347,
      "N3": 348,
      "CC2)cc1": 349,
      "C(F)(F)F": 350,
      "CCN(C": 351,
      "=C(N)": 352,
      "c12)": 353,
      "c21": 354,
      "c2[nH]": 355,
      "c4)": 356,
      "nc3": 357,
      "cc3)": 358,
      "CCC1": 359,
      "c1=O": 360,
      "c4ccccc4)": 361,
      "c1cccc2": 362,
      "[C@@H]4": 363,
      "CCn1": 364,
      "CC3": 365,
      "CCNC(=O)": 366,
      "CC[C@H](": 367,
      "C4": 368,
      "c1-": 369,
      "CCC(=O)O)": 370,
      "c3cccc(": 371,
      "Cc1cccc(": 372,
      ")cc(": 373,
      "C(=S": 374,
      "(C)C": 375,
      "=C(C)": 376,
      "c2ccc3c(": 377,
      "c2cc3": 378,
      "n(-": 379,
      "c3cn": 380,
      "P(=O)(O)": 381,
      "c(N)": 382,
      "c2ccccc21": 383,
      "COc1ccccc1": 384,
      "n1)": 385,
      "c2ccccc2)cc1": 386,
      "COc1cccc(": 387,
      ")cc2)": 388,
      ".O=C(O)": 389,
      "([O-])": 390,
      "n3)": 391,
      "COc1ccc(-": 392,
      "CC(=O)O": 393,
      "CCC2": 394,
      "Cc1cn": 395,
      "c2=O)": 396,
      "CCC(=O)N": 397,
      "c3ccc(F)cc": 398,
      "c4c(": 399,
      "[C@H]4": 400,
      "S(C)": 401,
      "c1ccc(F)cc1": 402,
      "[C@@H](O": 403,
      "c3ccc(Cl)cc": 404,
      "Cc2ccc(": 405,
      "c5cccc": 406,
      "C(N)": 407,
      "=C1": 408,
      "CN(C": 409,
      "=C2": 410,
      "Nc1n": 411,
      "CC4)": 412,
      "[C@H]1O": 413,
      "CCS": 414,
      "CCCO": 415,
      "CCCC1": 416,
      "C[C@]": 417,
      "C(=N": 418,
      "c6": 419,
      "Cc1c[nH]": 420,
      "ncc": 421,
      "c2n1": 422,
      "c1ccc(O": 423,
      "OC)c(OC)": 424,
      "c2ccc3c(c2)": 425,
      "3CCCC": 426,
      "C#N": 427,
      "Cc1ccc(-": 428,
      "c2cccn": 429,
      "C[C@H]2": 430,
      "c1OC": 431,
      "CCN2": 432,
      "Cn2": 433,
      "c1ccc(N": 434,
      "C)cc1": 435,
      "C2CCCC": 436,
      "CC(O)": 437,
      "=C(\\": 438,
      "[C@@]1": 439,
      "CC(N)=O)": 440,
      "nn1": 441,
      "C2)cc1": 442,
      "N(C)": 443,
      "c2ccccc12)": 444,
      "S)": 445,
      "c2ccc(Cl)cc2)": 446,
      "S(C)(=O)=O)": 447,
      "O)cc1)": 448,
      "CCN(CC)": 449,
      "CC(=O)N1": 450,
      "C[C@@H]2": 451,
      "c2nc(-": 452,
      "COc1cc2": 453,
      "O1": 454,
      "c(C(=O)N": 455,
      "CCCN(": 456,
      "C(=S)N": 457,
      "C1)": 458,
      "n(C": 459,
      "c1cc(-": 460,
      "/N=C/": 461,
      "/C(=N": 462,
      "Br)cc": 463,
      "c2cc(-": 464,
      "=N/": 465,
      "[C@H](O": 466,
      "C(=O)N(": 467,
      "3)cc2": 468,
      "O)cc": 469,
      "[C@@H]1O": 470,
      "n4": 471,
      "nc(C)": 472,
      "c(C)c1": 473,
      "c2)c1": 474,
      "no": 475,
      "CCC(N)=O)": 476,
      "CCCN2": 477,
      "O[C@H](CO)": 478,
      "Cl)c(Cl)": 479,
      "c2ncn": 480,
      "C(=O)N[C@@H](CC(C)C)": 481,
      "c2ccc(F)cc2)": 482,
      "cn2": 483,
      "C=C": 484,
      "[C@@]3": 485,
      ".O=C(O)C(F)(F)F": 486,
      "CC(=O)N[C@@H](": 487,
      "C(C)C": 488,
      "/C=C\\": 489,
      "C[C@H](O)": 490,
      "COc1cc": 491,
      "c3ccccc23)": 492,
      "CS(=O)(=O)": 493,
      "c2c[nH]": 494,
      "CC(C": 495,
      "CCC[C@H]1": 496,
      "[C@@H](O)[C@H](O)": 497,
      "CC1(C)": 498,
      "CN(C(=O)": 499,
      "c2ccccc12": 500,
      "[C@]2": 501,
      "cc(C)": 502,
      "c5ccccc5": 503,
      "ncc1": 504,
      "cs1": 505,
      "C(=O)N[C@@H](CCCNC(=N)N)": 506,
      "cnc1": 507,
      "CCN(C)": 508,
      "C(=O)N[C@@H](CCCCN)": 509,
      "c2cc1": 510,
      "(N)": 511,
      "c(O": 512,
      "c34)": 513,
      "CC[C@@H](": 514,
      "(O": 515,
      "C(=O)[C@H](": 516,
      "CCOCCO": 517,
      "C[C@@H](O)": 518,
      "CCOCC2)": 519,
      "c2cccc3": 520,
      "c4cc(": 521,
      "OC(": 522,
      "c1nc(-": 523,
      "c3ccc(F)cc3)": 524,
      "c3[nH]": 525,
      "C(=O)OC": 526,
      "cccn": 527,
      "C(=O)NC": 528,
      "[C@@H](C)O)": 529,
      "S(=O)(=O)N2": 530,
      "Cc1cc(C)": 531,
      "NC(=O)[C@H](CC(C)C)": 532,
      "c2s": 533,
      "C(=O)N[C@@H](C)": 534,
      "CC[C@H](C)": 535,
      "[C@]1": 536,
      "Cc1ccc(O)cc1)": 537,
      "O=S(=O)": 538,
      "n[nH]": 539,
      "Cc1c[nH]c2ccccc12)": 540,
      "NC(=O)CNC(=O)": 541,
      "Cl)c1": 542,
      "OCCO": 543,
      "c(cc1": 544,
      "CC[C@]2": 545,
      "nc2c1": 546,
      "[C@@H]5": 547,
      "CCCC(=O)": 548,
      ")ccc1": 549,
      "Cc1c(": 550,
      "3)cc2)": 551,
      "CCOCC1": 552,
      ".[": 553,
      "c3cccn": 554,
      "N=C(": 555,
      "cccc2": 556,
      "N=C(N)": 557,
      "3CCO": 558,
      "c2ccc(O": 559,
      "#N)": 560,
      "NC(=O)[C@@H]1": 561,
      "C(=O)OC)": 562,
      "/C(=C\\": 563,
      "C(N)=O": 564,
      "Br)cc1": 565,
      "NC": 566,
      "c3ccc(Cl)cc3)": 567,
      ".[N": 568,
      "C3=O)": 569,
      "a+]": 570,
      ".[Na+]": 571,
      "N(C)C)": 572,
      "C)cc": 573,
      "O=c1": 574,
      "C4)": 575,
      "C1CCCCC1": 576,
      "c2ccc(O)": 577,
      "nc(N)": 578,
      "[S": 579,
      "NC(=O)[C@H](C)": 580,
      "2)C1": 581,
      "c2o": 582,
      "c1cccc(-": 583,
      "CC2)c1": 584,
      "c2)CC1": 585,
      "c2nc(N": 586,
      "(F)(F)": 587,
      "C(F)(F)F)cc1": 588,
      "C2=O": 589,
      "c2ccn": 590,
      "C=C1": 591,
      "(C)(": 592,
      "c3ccc(-": 593,
      "CCC3": 594,
      "CCOc1ccc(": 595,
      "/C=C": 596,
      ")cc3)": 597,
      "(C(F)(F)F)": 598,
      "C(=O)N(C)": 599,
      "c2ccc(Cl)cc2": 600,
      "[C@]3": 601,
      "CCO)": 602,
      "O[C@@H](": 603,
      "NC(=O)[C@@H](N)": 604,
      "c2nc3ccccc3": 605,
      "CC[C@H]2": 606,
      "4(C)": 607,
      "NC(=O)[C@H](CCCNC(=N)N)": 608,
      "C=C(": 609,
      "3C)": 610,
      "C2(": 611,
      "CN1C(=O)": 612,
      "C(=O)N[C@@H](Cc1ccccc1)": 613,
      "CN1CCN(": 614,
      "NC1": 615,
      "OC)c1OC": 616,
      "N4": 617,
      "C[C@@H]3": 618,
      "nc(S": 619,
      "ccc3": 620,
      "CCCCC2)": 621,
      "/C(=C/": 622,
      "c2cc(Cl)cc": 623,
      "c2c(C)": 624,
      "CN3": 625,
      "n1-": 626,
      "CCCC2": 627,
      "c1s": 628,
      "c2cccc(Cl)": 629,
      "Cl)c(": 630,
      "c3cc4": 631,
      "4)cc3)": 632,
      "c23)cc1": 633,
      "O=S(=O)(": 634,
      "/C(=N\\": 635,
      "N(C": 636,
      "C2=N": 637,
      "CC[C@@H]1": 638,
      "C(=O)N1CCC[C@H]1": 639,
      "CCC(C)": 640,
      "cc4": 641,
      "c(NC(=O)": 642,
      "C[C@H]3": 643,
      "c2ccco": 644,
      "(Cl)": 645,
      "n2cn": 646,
      "CC4": 647,
      "CC[C@H]1": 648,
      "c(S": 649,
      "(N)(=O)=O)": 650,
      "c1C": 651,
      "c3ccc4c(": 652,
      "c2cccs": 653,
      "nn2": 654,
      "[N+](=O)[O-])cc1": 655,
      "=C(N)N)": 656,
      "/C=C(\\": 657,
      "[N+]([O-])": 658,
      "CC[C@]3": 659,
      "cccc1": 660,
      "C1CCN(": 661,
      "[n+]1": 662,
      "NC(=O)[C@H](CCCCN)": 663,
      "C1(": 664,
      "Cl.": 665,
      "n2)c1": 666,
      "[C@@]2(C)": 667,
      "C2CC2)": 668,
      "c2ncc": 669,
      "c2c(c1)": 670,
      "c2-": 671,
      "Cc2ccccc2": 672,
      "C2=O)cc1": 673,
      "NC(=O)[C@H](CO)": 674,
      "C(=O)NCC": 675,
      "NC(=O)O": 676,
      "c2c(-": 677,
      "c2ccc(C)": 678,
      "CC(=O)N2": 679,
      "c1c(C)": 680,
      "c5ccc(": 681,
      "c4cn": 682,
      "/C=N/": 683,
      "NC(C)=O)": 684,
      "C3CCCC": 685,
      "CCCN=C(N)N)": 686,
      "C1=": 687,
      "c1ccc(NC(=O)": 688,
      "/C(C)": 689,
      "CCc1n": 690,
      "CSc1n": 691,
      "(CO)": 692,
      "s2)": 693,
      "N1CCN(": 694,
      "CCCCCCCCCCCC": 695,
      "CCCNC(=O)": 696,
      "c1c[nH]": 697,
      "CCS(=O)(=O)": 698,
      "C(=N)N": 699,
      "no1": 700,
      "5)cc": 701,
      "c2cs": 702,
      "NC1=O": 703,
      "O=[N+]([O-])": 704,
      "S(N)(=O)=O)": 705,
      "co1": 706,
      "cc(O)": 707,
      "c1ccc(N2": 708,
      "c1nc(N": 709,
      "C1=O)": 710,
      "C1=C(": 711,
      "C(=O)N3": 712,
      "P(=O)(O)O": 713,
      "CCCn1": 714,
      "c2ccc(OC)": 715,
      "[nH]1": 716,
      "c3ccc(O)": 717,
      "nc12": 718,
      "cn1)": 719,
      "s1)": 720,
      "Cc3ccccc3)": 721,
      "c(C(=O)O)": 722,
      "3CCOCC3)": 723,
      "c3c2": 724,
      "c(OC)c1": 725,
      "C(=O)[C@@H](": 726,
      "CCOCC": 727,
      "C(=O)N[C@@H](CO)": 728,
      "c3ccc4c(c3)": 729,
      "c2ccccc2)CC1": 730,
      "ccc2": 731,
      "C1CC1": 732,
      "c3ccc(C)": 733,
      "F)c(F)": 734,
      "[nH]c(=O)": 735,
      "=S)": 736,
      "Cc1cc2": 737,
      "c3ccn": 738,
      "/C=C2": 739,
      "c1c(O)": 740,
      "[N+](=O)[O-])cc": 741,
      "CC[C@H](C)[C@H](": 742,
      "O2)": 743,
      "c3ccc(O": 744,
      "c2ccccc2c1": 745,
      "c1ccc(Br)cc1": 746,
      "(C(=O)N": 747,
      "c1cccnc1": 748,
      "CCCCN": 749,
      "[C@@H]2O": 750,
      "C(=O)N[C@@H](CCC(=O)O)": 751,
      "c2ccccc2)c1": 752,
      "ccn": 753,
      "[C@H]5": 754,
      "6)": 755,
      "CC[C@@]": 756,
      "C[C@@]": 757,
      "c2ccc(N": 758,
      "Cc1nc(": 759,
      "c3ncn": 760,
      "C2CCCCC2)": 761,
      "NC(=O)[C@H](Cc1ccccc1)": 762,
      "C(=O)N(C": 763,
      "C12": 764,
      "O=C1N": 765,
      "[C@H]2O)": 766,
      "c4n": 767,
      "CC3)cc": 768,
      "CC(C)C[C@H](": 769,
      "c1ccccc1-": 770,
      "CN)": 771,
      "c1ccncc1": 772,
      "c2)n1": 773,
      "N2CCN(": 774,
      "CCc1ccc(": 775,
      "C[C@@H](C)": 776,
      "C(=O)O)cc1": 777,
      "c2c(=O)": 778,
      "c2c[nH]c3ccccc23)": 779,
      "oc(": 780,
      "c3)cc": 781,
      "c2cc(C)": 782,
      "CC(C)(C)O": 783,
      "c2ccc(F)cc2": 784,
      "CCCCO": 785,
      "ncc2": 786,
      "CCN1C(=O)": 787,
      "C=C(C)": 788,
      "c3ccccc3)cc": 789,
      "O[C@H](CO)[C@@H](O)[C@H](O)": 790,
      "C5": 791,
      "c2ccc3ccccc3": 792,
      "c1cc(Cl)cc": 793,
      "C1=N": 794,
      "C2=C(": 795,
      "c2cccc(F)": 796,
      "c3cc(Cl)cc": 797,
      "c1cccc(F)": 798,
      "2)n1": 799,
      "C(=O)/C=C/": 800,
      "c4ccc(F)cc": 801,
      "Cn1cc(": 802,
      "c3ccco": 803,
      "c1ncc": 804,
      "4CCCC": 805,
      "C(C)=O": 806,
      "C3CC3)": 807,
      "c3cccc4": 808,
      "c2=O)cc1": 809,
      "C(F)(F)F)c1": 810,
      "c(=O)n2": 811,
      "OC)c(OC)c(OC)": 812,
      "O)c(O)": 813,
      "CCCC(": 814,
      "ccc1": 815,
      "c(Cl)c1": 816,
      "[N+](C)": 817,
      "c1ccc(Cl)cc1)": 818,
      "O)cc2)": 819,
      "CC[C@]3(C)": 820,
      "cs3)": 821,
      "c2cc(O)": 822,
      "c2ccc(N3": 823,
      "CCC[C@H](": 824,
      "COc1ccc2c(c1)": 825,
      "cccc3": 826,
      "c1c(-": 827,
      "(O)(": 828,
      "sc1": 829,
      "(C)(O)": 830,
      "3)c1": 831,
      "NC(=O)[C@@H]2": 832,
      "(=O)=O": 833,
      "c3s": 834,
      "o2)cc1": 835,
      "C(=O)N[C@@H](CCC(N)=O)": 836,
      "CC(=O)N(": 837,
      "NC(=O)[C@H](CCC(=O)O)": 838,
      "c1nc2ccccc2": 839,
      "C(=O)NC(": 840,
      "O2": 841,
      "c3cccc(Cl)": 842,
      "12C": 843,
      "c(Br)": 844,
      "C(=O)NCC(=O)N[C@@H](": 845,
      "c2C)": 846,
      "Br-]": 847,
      "NC(=O)C(": 848,
      "O=C(/C=C/": 849,
      "CN(C)C(=O)": 850,
      "cc2)cc1": 851,
      "C(=O)N[C@@H](CC(=O)O)": 852,
      "(C#N)": 853,
      "s3)": 854,
      "NC(=O)[C@@H]1CCCN1": 855,
      "NC(=O)[C@H](CC(=O)O)": 856,
      "S1": 857,
      "CCC2(": 858,
      "OC)cc1": 859,
      "c3ccccn3)": 860,
      "NC(=O)[C@H](C": 861,
      "P(=O)(O)O)": 862,
      ")cc(OC)c1OC": 863,
      "c2cc3c(": 864,
      "c1cs": 865,
      "C(C)(C)C": 866,
      "c2cccnc2)": 867,
      "Nc1ccc(": 868,
      "CCCCC1)": 869,
      "c1cccc(Cl)c1": 870,
      ".[Br-]": 871,
      "[C@@H](C)CC)": 872,
      "c3nn": 873,
      "C(=O)C(": 874,
      "c2ccccn2)": 875,
      "n2)CC1": 876,
      "OC(C)=O)": 877,
      "NC(": 878,
      ")ccc1O": 879,
      "OC1": 880,
      "-c2n": 881,
      "cn2)": 882,
      "C2CCN(": 883,
      "/C=C(\\C)": 884,
      "4)CC3)": 885,
      "Nc1nc(": 886,
      "c1ccccn1": 887,
      "COc1cc2c(cc1": 888,
      "n1cn": 889,
      "CCC(O)": 890,
      "c2ccc(Br": 891,
      "=C(/": 892,
      "Cc3ccccc3": 893,
      ")N1CCN(": 894,
      "c4ccccc34)": 895,
      "c32)": 896,
      "Cc1ccc(NC(=O)": 897,
      "CCCCN1": 898,
      "P(=O)(": 899,
      "CCc1ccccc1": 900,
      "c([N+](=O)[O-])": 901,
      "/C=C2\\": 902,
      "c2c(O)": 903,
      "nc1-": 904,
      "NC(=O)OC": 905,
      "oc(-": 906,
      "CSS": 907,
      "c1ccc(-c2n": 908,
      "[C@@]1(C)": 909,
      "=C1\\": 910,
      "c2cc(F)cc": 911,
      "c4[nH]": 912,
      "/N=C(\\": 913,
      "c2ccc3c(c2)OCO": 914,
      "c3ccco3)": 915,
      "/C=N": 916,
      "NC(=O)[C@H](CCC(N)=O)": 917,
      "C(=O)N[C@@H](CC(N)=O)": 918,
      "c4ccc(Cl)cc": 919,
      "Cc1ccc2c(c1)": 920,
      "[S+]": 921,
      "c1ccc([N+](=O)[O-])cc1": 922,
      "CC(CC(C": 923,
      "CC1(": 924,
      "c(=O)o": 925,
      "CCCC2)": 926,
      "N[C@@H](": 927,
      "4)cc3": 928,
      "c1[nH]": 929,
      "c(F)c1": 930,
      "CC[C@@H]4": 931,
      "CCN(C)CC": 932,
      "CCN3": 933,
      "c1ccccc1)c1ccccc1": 934,
      "c2ccc(NC(=O)": 935,
      "cnc2": 936,
      "CCCCCC": 937,
      "c2cccc(C(F)(F)F)": 938,
      "c2ccc(C(F)(F)F)cc": 939,
      "[C@@]5": 940,
      "c2cccc(-": 941,
      "CCCCCCCCCCCCCCCC": 942,
      "O[C@H]1": 943,
      "c2ccccc2Cl)": 944,
      "[C@]1(C)": 945,
      "N2C(=O)": 946,
      "Cn1cn": 947,
      "I)": 948,
      "OCO2": 949,
      "CCN(C)C)": 950,
      "c[nH]1)": 951,
      "N(C(=O)": 952,
      "c-": 953,
      "CC[C@@H]2": 954,
      "=CC(=O)": 955,
      "c1ccc(F)cc1)": 956,
      "c1cccc2cccc": 957,
      "c1cccs1": 958,
      "C[C@H](C)": 959,
      "nc4": 960,
      "cn3)": 961,
      "c2ccccc2)n1": 962,
      "c3cccnc3)": 963,
      "C=O)": 964,
      "c3ccc(OC)": 965,
      "NC(=O)CNC(=O)[C@H](": 966,
      "[C@H](O)[C@@H](O)": 967,
      "c(C#N)": 968,
      "[C@H](OC(=O)": 969,
      "c1)N": 970,
      "c2ncc(": 971,
      "[C@H](OC(C)=O)": 972,
      "c3=O)": 973,
      "o2)": 974,
      "CC[C@]2(C)": 975,
      "s2)cc1": 976,
      "CC1=C(": 977,
      "NCC": 978,
      "n2cc(": 979,
      "nc(NC(=O)": 980,
      "CCC4": 981,
      "c2ccco2)": 982,
      "Cc2ccc(O)cc2)": 983,
      "Cc1ccc(O": 984,
      "[C@@H]6": 985,
      "(CC)": 986,
      "C(=O)N[C@H]1": 987,
      "[C@@H](N)": 988,
      "CCOCC4)": 989,
      "[n+]2": 990,
      "nc21": 991,
      "c2ccc3": 992,
      "c2ccccc2F)": 993,
      "c5c(": 994,
      "c1ccc2[nH]": 995,
      "(C(=O)O)": 996,
      "cs1)": 997,
      "c3c(C)": 998,
      "/C1": 999,
      "COc1cc(OC)": 1000,
      "Cn1c(=O)": 1001,
      "CC[C@]4": 1002,
      "(C)c1": 1003,
      "O[C@@H]1": 1004,
      "c2ccc(C(=O)N": 1005,
      "c3ccc(Cl)cc3": 1006,
      "c2cccs2)": 1007,
      "c2ccncc2)": 1008,
      "c1ccco1": 1009,
      "c(N2": 1010,
      "CCCN(C": 1011,
      "Cc1cccc": 1012,
      "Oc1ccc(": 1013,
      "CCCC1)": 1014,
      "CCCN(C(=O)": 1015,
      "cc(OC)": 1016,
      "[C@H](O)[C@H](O)": 1017,
      "Cc1cnc[nH]1)": 1018,
      "c1cccc2c1": 1019,
      "Cc1ccc(Cl)cc1": 1020,
      "c5)": 1021,
      "c(N3": 1022,
      "S(=O)(=O)O)": 1023,
      "c5ccccc5)": 1024,
      "c(=O)n1": 1025,
      "C(=O)Nc1ccc(": 1026,
      "n2cc": 1027,
      "CS)": 1028,
      "c3ncc": 1029,
      "[Cl": 1030,
      "C/C=C\\": 1031,
      "3)CC1": 1032,
      "[C@@H](OC(=O)": 1033,
      "COc1ccc(NC(=O)": 1034,
      "c3ccncc3)": 1035,
      "O[C@H](CO": 1036,
      "c2ccc(S(=O)(=O)N": 1037,
      ")cc3": 1038,
      "O[C@@H]3": 1039,
      "c2cccc(Cl)c2)": 1040,
      "(CCCC": 1041,
      "CC(F)(F)": 1042,
      "c2ccccc2n1": 1043,
      "CCN1CCN(": 1044,
      "O[C@@H]2": 1045,
      "[C@@H](CO)": 1046,
      "CCC(=O)": 1047,
      "c2c(F)cc": 1048,
      "c1ncn2": 1049,
      "n4)": 1050,
      "c3cc4c(": 1051,
      "C(=O)N[C@@H](Cc1c[nH]c2ccccc12)": 1052,
      "F)cc2": 1053,
      "c(=O)[nH]c1=O": 1054,
      "NC(=S)N": 1055,
      "c3cccs3)": 1056,
      "%1": 1057,
      "CC(C)=": 1058,
      "c7": 1059,
      "CCOCC1)": 1060,
      "sc2c1": 1061,
      "S(=O)(=O)N1": 1062,
      "NC(=O)[C@H](CC(N)=O)": 1063,
      "N)ncn": 1064,
      "C(c2ccccc2)": 1065,
      "c3cc(-": 1066,
      "C(F)F)": 1067,
      "/C=C/C(=O)": 1068,
      "CC[C@]4(C)": 1069,
      "c1ccccc1)N": 1070,
      "C2)c1": 1071,
      "=[N+]": 1072,
      "c2cccc3cccc": 1073,
      "c1cc(C)": 1074,
      "n3cn": 1075,
      "c1=O)": 1076,
      "CC[C@H]3": 1077,
      "c3)cc2": 1078,
      "Cc1ccc(F)cc1": 1079,
      "c5cc": 1080,
      "3)cc2)cc1": 1081,
      ".[Na+].[Na+]": 1082,
      "C[C@H](N)": 1083,
      "c2ccc([N+](=O)[O-]": 1084,
      "c(O)c1": 1085,
      "CN2CCN(": 1086,
      "c2ncccc2": 1087,
      "nn2)": 1088,
      "C(=S)": 1089,
      "c(C(=O)": 1090,
      "/C(=N/": 1091,
      "n(CC": 1092,
      "3CCCCC3)": 1093,
      "CCOC(=O)C1": 1094,
      "[C@@H](OC(C)=O)": 1095,
      "CCOCC2)cc1": 1096,
      "ncc(": 1097,
      "oc2c1": 1098,
      "c2cc3cccc": 1099,
      "c3cccc(F)": 1100,
      "c3ccc(C(F)(F)F)cc": 1101,
      "Cl)cc2": 1102,
      "c2cc(NC(=O)": 1103,
      "c2F)": 1104,
      ")cc1)": 1105,
      "c1cccn": 1106,
      "C[C@H](NC(=O)": 1107,
      "[C@@H](C)O": 1108,
      "N=C(N)N": 1109,
      "c(C(F)(F)F)": 1110,
      "c3c2)": 1111,
      "c2nc(C)": 1112,
      "c(=O)n(C)": 1113,
      "CC[C@@H]3": 1114,
      "c2c(Cl)cc": 1115,
      "O[C@H]2": 1116,
      "[Cl-]": 1117,
      "[C@]2(C)": 1118,
      "n2-": 1119,
      "OC[C@H]1O": 1120,
      "nn3": 1121,
      "CCC3)": 1122,
      "Cc1cc(-": 1123,
      "CC2)CC1": 1124,
      "c2c1)": 1125,
      "c1ccc(C(=O)N": 1126,
      "CN1CCC(": 1127,
      "c3cc(C)": 1128,
      "CCCC[C@H](": 1129,
      "c3ccc(Br)cc": 1130,
      "CNS(=O)(=O)": 1131,
      "O[C@H](CO)[C@@H](O)": 1132,
      "COc1cc(-": 1133,
      "[C@]12": 1134,
      "cc21": 1135,
      "C(=O)N[C@@H](Cc1ccc(O)cc1)": 1136,
      "c2c3c(": 1137,
      "c1ccc(O)cc1": 1138,
      "c3nc4ccccc4": 1139,
      "CC#": 1140,
      "c3ccccc32)": 1141,
      "C(=O)N1CCC(": 1142,
      "c3ccccc3)cc2)": 1143,
      "c3ccc(F)cc3": 1144,
      "CC(C)O": 1145,
      "CCN)": 1146,
      "=C(C)C)": 1147,
      "3CCCC3)": 1148,
      "C(C(=O)N": 1149,
      "/C=N/N": 1150,
      "C(=O)OC(C)(C)C)": 1151,
      "CCC[C@@H]1": 1152,
      "c2nc3c(": 1153,
      "[C@@]3(C)": 1154,
      "N1C(=O)": 1155,
      "c2cc1OC": 1156,
      "/C(C)=C/": 1157,
      "CC2)n1": 1158,
      ".[Cl-]": 1159,
      "CCCCNC(=O)": 1160,
      "c2cc(C": 1161,
      "ccc4": 1162,
      "C3)cc": 1163,
      "C[C@]12": 1164,
      "FC(F)(F)": 1165,
      "NC(=O)OC(C)(C)C)": 1166,
      "c3ccccc23)cc1": 1167,
      "n2c(": 1168,
      "c3c[nH]": 1169,
      "Cc1no": 1170,
      "[C@H]6": 1171,
      "c1cccc(F)c1": 1172,
      "CC2(": 1173,
      "OC3": 1174,
      "Cc1ccc(N": 1175,
      "CC3)cc2": 1176,
      "C(=O)N1CCN(": 1177,
      "c4ccccc43)": 1178,
      "(c2ccccc2)": 1179,
      "COc1n": 1180,
      "Cc1ccc(C(=O)N": 1181,
      "C[C@]1": 1182,
      "OCO4)": 1183,
      "1C": 1184,
      ".Cl.Cl": 1185,
      "c2ccccc2-": 1186,
      "CC(C)[C@H](": 1187,
      "nn3)": 1188,
      "c1cc2cccc": 1189,
      "C(=O)NCC(=O)N": 1190,
      "c3cc(O)": 1191,
      "COc1ccc2c(": 1192,
      "c1ccc(C(F)(F)F)cc1": 1193,
      "c3nc(": 1194,
      "c3ccccc32)cc1": 1195,
      "c2cc(C(=O)N": 1196,
      "cc1)": 1197,
      "c3ccc(N4": 1198,
      "on1": 1199,
      "c3ccc(C(=O)N": 1200,
      "CC(=O)Nc1ccc(": 1201,
      "c(-c3ccccc3)": 1202,
      "c2ccc(O)cc2)": 1203,
      "nc2n1": 1204,
      "N2CCOCC2)": 1205,
      "CC[C@]43C)": 1206,
      "c3C)": 1207,
      "n12": 1208,
      "CC=": 1209,
      "OC)c1": 1210,
      "O3)": 1211,
      "[C@@]12": 1212,
      "CC[C@@]2": 1213,
      "OC2": 1214,
      "C(=O)c1ccccc1": 1215,
      "CCCCC": 1216,
      "(CCC)": 1217,
      "c6cccc": 1218,
      "c2)C1": 1219,
      "OC(C)(C)": 1220,
      "c2nnc(-": 1221,
      "Cc1ccc(S(=O)(=O)N": 1222,
      "ncc3": 1223,
      "C2=": 1224,
      "CCCN3": 1225,
      "c1ccc(Cl)c(Cl)": 1226,
      "c2nnc(": 1227,
      "[n+](": 1228,
      "I-]": 1229,
      "c1ccc(OC": 1230,
      "c2ccc(Cl)c(Cl)": 1231,
      "Cc1cs": 1232,
      "CO[C@H]1": 1233,
      "[nH]c(": 1234,
      "CN2C(=O)": 1235,
      "CCSC)": 1236,
      "[C@@]4": 1237,
      "c2cc3c(cc2": 1238,
      "=N\\": 1239,
      "o3)": 1240,
      "c2[nH]1": 1241,
      "c2cc(O": 1242,
      "NC(=O)[C@H](Cc1ccc(O)cc1)": 1243,
      "co1)": 1244,
      "CCOCC3)": 1245,
      "[C@@H]12": 1246,
      ".[I-]": 1247,
      "c1cc2c(cc1": 1248,
      "c3ccc(C)cc3)": 1249,
      "n1cc(": 1250,
      "CC=C": 1251,
      "COc1cc2c(cc1OC)": 1252,
      "nc2-": 1253,
      "c2Cl)": 1254,
      "O)c(": 1255,
      "NC(=O)C1": 1256,
      "c3cccc(Cl)c3)": 1257,
      "N)cc": 1258,
      "C#N)cc": 1259,
      "[C@@H](O)[C@H](": 1260,
      "CCc1cc(": 1261,
      "C3CCCCC3)": 1262,
      "c4cccn": 1263,
      "CCCC(C)": 1264,
      "N(C)C(=O)": 1265,
      "OCC(O)": 1266,
      "C/C(=N\\": 1267,
      "c2C1": 1268,
      "C/C(=C\\": 1269,
      "C4=O)": 1270,
      "[C@H]3O)": 1271,
      "[N-]": 1272,
      "c2ccc3c(c2)OCO3)": 1273,
      "NC(=O)[C@H](Cc1c[nH]c2ccccc12)": 1274,
      "c2ccc(Br)cc2)": 1275,
      "c2nnn": 1276,
      "CCCN1C(=O)": 1277,
      "C(F)(F)F)cc(C(F)(F)F)": 1278,
      "c3cc4c(cc3": 1279,
      "CCC2(CC1)": 1280,
      "COc1ccc(OC)": 1281,
      "N1CCC(": 1282,
      "CCC[C@H]2": 1283,
      "CCn1cc(": 1284,
      "n2cnc3c(": 1285,
      "Cc2cn": 1286,
      "(CC(=O)N": 1287,
      "Cn1cc": 1288,
      "CC[C@@H]4[C@@]5": 1289,
      "c2ccc(C)cc2)": 1290,
      "c3cc(F)cc": 1291,
      "CCc2c(": 1292,
      "n2C)": 1293,
      "Nc1ncn": 1294,
      "CCCN)": 1295,
      "S)N": 1296,
      "COc1ccc(C2": 1297,
      "[S+]([O-])": 1298,
      "(=O)o": 1299,
      "n2nc(": 1300,
      "c1ccc(C)cc1": 1301,
      "CO[C@@H]1": 1302,
      "Cc1ccccc1)N": 1303,
      "COc1cccc(-": 1304,
      "C1CCCC1": 1305,
      "CCC3(": 1306,
      "cn3": 1307,
      "c1ccccc1O": 1308,
      "[C@@H]5CC[C@]43C)": 1309,
      "c3ccccc3)cc2": 1310,
      "c3ccc(O)cc3)": 1311,
      "CCl": 1312,
      "c32)cc1": 1313,
      "Cc1c(-": 1314,
      "C/C=C/": 1315,
      "Cc1cccc(-": 1316,
      "CCOc1cc(": 1317,
      "c3c(F)cc": 1318,
      "COc1ccc(N": 1319,
      "c1cc2c(": 1320,
      "CCC(=O)O": 1321,
      "CCC[C@@H](": 1322,
      "CCCC)": 1323,
      "c1ncc(": 1324,
      "C(C)C)cc1": 1325,
      "CC5)": 1326,
      "OC)cc": 1327,
      "CS(=O)(=O)N": 1328,
      "/C=C/C": 1329,
      "c3ccc4ccccc4": 1330,
      "NC(=O)c1ccc(": 1331,
      "c1cccc(NC(=O)": 1332,
      "c3nc(-": 1333,
      "CN4": 1334,
      "c3o": 1335,
      "c4ccc(F)cc4)": 1336,
      "CC[C@@H](C)": 1337,
      "c1nc2c(": 1338,
      "-c1ccccc1": 1339,
      "CC[C@H]2[C@@H]3": 1340,
      "c1ncn": 1341,
      "c1cn(": 1342,
      "nn2)cc1": 1343,
      ")cc12": 1344,
      "CCCC(=O)N": 1345,
      "c2cc(F)": 1346,
      "Cc1nc(-": 1347,
      "CNC(=O)N": 1348,
      "CC(N)": 1349,
      "[C@H](C)[C@@H](O": 1350,
      "c3ccccc3)CC2)": 1351,
      "[C@H](CO)": 1352,
      "c1cccc(N": 1353,
      "c(=O)[nH]1": 1354,
      "c2ccc(OC": 1355,
      "c2ccc(Cl)cc2Cl)": 1356,
      "c4cccc(": 1357,
      "CCCS": 1358,
      "C(=O)N2CCN(": 1359,
      "C(N": 1360,
      "2)cc1)": 1361,
      "Cc1c[nH]cn1)": 1362,
      "NC(=O)[C@@H]2CCCN2": 1363,
      "Cc1cc(N": 1364,
      "Cn3": 1365,
      "c1N": 1366,
      "CN2CCC(": 1367,
      "nc2c(": 1368,
      "/C=N/NC(=O)": 1369,
      "c2ccs": 1370,
      "CC(C)N": 1371,
      "c1cc(F)cc": 1372,
      "C2)C1": 1373,
      "O=S(=O)(N": 1374,
      "Cc1ccc(C)": 1375,
      "COC1": 1376,
      "c3ccccc3Cl)": 1377,
      "c2nc(N)": 1378,
      "c1cccc(O": 1379,
      "c2cc(S(=O)(=O)N": 1380,
      "C(=O)N[C@@H](CCCN=C(N)N)": 1381,
      "c1c(Cl)cc": 1382,
      "CCCC3": 1383,
      ")N(": 1384,
      "C[C@]2": 1385,
      "C1CCCCC1)": 1386,
      "cc12": 1387,
      "=C3": 1388,
      "CC[C@]12C": 1389,
      "COc1ccc(C(=O)N": 1390,
      "c2ccc3ccccc3c2)": 1391,
      "CCOc1ccccc1": 1392,
      "c2O)": 1393,
      "o1)": 1394,
      "c2ccc(F)": 1395,
      "CCC(C)(C)": 1396,
      "O=c1[nH]": 1397,
      "CC[C@@]2(C)": 1398,
      "c1ccccc1Cl": 1399,
      "C(=O)C1": 1400,
      "c2ccc3n": 1401,
      "C[C@@H]4": 1402,
      "[C@](C)(": 1403,
      "[C@H](O)[C@@H]1O": 1404,
      "/C=C/C(=O)N": 1405,
      "C#N)cc1": 1406,
      "CCC(=O)N1": 1407,
      "CC2CC2)": 1408,
      "C2)n1": 1409,
      "CCCC3)": 1410,
      "CN(CC": 1411,
      "[C@@](C)(": 1412,
      "C#C": 1413,
      "[nH]c2c1": 1414,
      "c2ccccc2)cc1)": 1415,
      "c2ccc(C(=O)O)": 1416,
      "C(C)C)C(C)C)": 1417,
      "NC(=O)[C@H](Cc2ccccc2)": 1418,
      "C(=O)N[C@@H](C": 1419,
      "CCCCC2": 1420,
      "nn(-": 1421,
      "4)cc2": 1422,
      "ncn1": 1423,
      "c1ccc(-c2cn": 1424,
      "c1nnc(": 1425,
      "c3ccccc3F)": 1426,
      "c2cccc3ccccc23)": 1427,
      "c45)": 1428,
      "CSCC[C@H](": 1429,
      "c1cc(N": 1430,
      "[C@]4": 1431,
      "O=C(NC1": 1432,
      "CC(=O)O[C@H]1": 1433,
      "O=C(Nc1ccc(": 1434,
      "C23": 1435,
      "CC(NC(=O)": 1436,
      "COCCO": 1437,
      "c2cc(OC)c(OC)c(OC)": 1438,
      "[C@@]1(O)": 1439,
      "C(N)=N": 1440,
      "c13)": 1441,
      "c(=O)n(": 1442,
      "nc2ccccc12": 1443,
      "[C@@]2(": 1444,
      "c1O)": 1445,
      "c(S(=O)(=O)N": 1446,
      "Br.": 1447,
      "c3cc2": 1448,
      "c2ccc(Cl)": 1449,
      "C=C2": 1450,
      "n4cn": 1451,
      "CNC": 1452,
      "CCC2)": 1453,
      ")cc(-": 1454,
      "CCc2ccccc2": 1455,
      "CC[C@H](O)": 1456,
      "c3cccc(C(F)(F)F)": 1457,
      "c1c(F)cc": 1458,
      "n1cc": 1459,
      "Cn1cc(-": 1460,
      "[P": 1461,
      ".O=C(O)C(=O)O": 1462,
      "c(=O)c(C(=O)O)": 1463,
      "C[n+]1": 1464,
      "CC(C)(": 1465,
      "c4=O)": 1466,
      "[nH]2)": 1467,
      "c1nc(C)": 1468,
      "CC12": 1469,
      "c2ccc(OC)cc2)": 1470,
      "c5cc(": 1471,
      "CCN(CC": 1472,
      "c2cc(N": 1473,
      "NC(=O)CS": 1474,
      "c2ccc3[nH]": 1475,
      "nc(O)": 1476,
      "N#Cc1ccc(": 1477,
      "Cc1cn(": 1478,
      "CCCCC2)cc1": 1479,
      "c2cccc(F)c2)": 1480,
      "N2CCC(": 1481,
      "COC(=O)C1": 1482,
      "CC[C@]4(C)[C@H]3": 1483,
      "ccn1": 1484,
      "P(=O)(O": 1485,
      "c1cccc2ccccc12": 1486,
      "cc(C)c(=O)[nH]": 1487,
      "c2cccc(O)": 1488,
      "c1ccc2ccccc2c1": 1489,
      "OCC(=O)N": 1490,
      "S(C)(=O)=O": 1491,
      "COc1ccc(Cl)cc1": 1492,
      "OC[C@H]1O[C@@H](": 1493,
      "[N+](=O)[O-])c1": 1494,
      ")N2": 1495,
      "[nH]1)": 1496,
      "[Si": 1497,
      "c-2": 1498,
      "C(=O)OCC)": 1499,
      "[C@H]2O": 1500,
      "C4CC4)": 1501,
      "C[C@@H]1O": 1502,
      "c(C": 1503,
      "c1nnc(-": 1504,
      "c4ccc(Cl)cc4)": 1505,
      "[Si]": 1506,
      "c1cccnc1)": 1507,
      "COP(=O)(O)O": 1508,
      "4CCOCC4)": 1509,
      "[C@H](N)": 1510,
      "c3ccc4c(c3)OCO4)": 1511,
      "SCC(=O)N": 1512,
      "c(-c2ccccc2)": 1513,
      "c2ccncc": 1514,
      "CCCO)": 1515,
      "c1cccc(O)": 1516,
      "c2ccc(Cl)cc2)cc1": 1517,
      "Cc1ccc(S(=O)(=O)": 1518,
      "c(=O)n3": 1519,
      "c1ccc(OC)cc1": 1520,
      "3)C1)": 1521,
      "NC(=O)CO": 1522,
      "c1cc(O)": 1523,
      "c(-c3ccc(": 1524,
      "COc1ccc(-c2n": 1525,
      "c1ccccc12": 1526,
      "c2ccccc2)C1": 1527,
      "C(C)(C)[C@@H]5CC[C@]43C)": 1528,
      "nc(N3": 1529,
      ".O=C(O)C(F)(F)F.O=C(O)C(F)(F)F": 1530,
      "n3)cc": 1531,
      "CCNS(=O)(=O)": 1532,
      "CN(C)C)": 1533,
      "c1cccc(C(F)(F)F)c1": 1534,
      "/c(": 1535,
      "c3cccc(F)c3)": 1536,
      "COc1ccc(S(=O)(=O)N": 1537,
      "COc1ccccc1-": 1538,
      "c1ccc(-n2": 1539,
      "c43)": 1540,
      "ccc12": 1541,
      "c2cccc(C(F)(F)F)c2)": 1542,
      "C2CCCC2)": 1543,
      "c1cccc(C": 1544,
      "N(CC": 1545,
      "Cc1ccccc1-": 1546,
      "COC(=O)N": 1547,
      "c3ccc(OC)cc3)": 1548,
      "c6ccccc6": 1549,
      "CCN(S(=O)(=O)": 1550,
      "c1ccccn1)": 1551,
      "[C@H]1CC[C@H](": 1552,
      "c3cccnc3": 1553,
      "[N+](C)(C)": 1554,
      "OC[C@H]3": 1555,
      "CC2)C1": 1556,
      "c3c(-": 1557,
      "Cc1cccc2": 1558,
      "Nc1ccccc1": 1559,
      "N5": 1560,
      "OO": 1561,
      "Cc1cc(C)cc(": 1562,
      "O[C@H]3": 1563,
      "ccc(-": 1564,
      "CC1=": 1565,
      "c1c2c(": 1566,
      "c2cc(=O)": 1567,
      "CCNCC3)": 1568,
      "cc2c1": 1569,
      "cnc2c1ncn2": 1570,
      "=C(O)": 1571,
      "N=C1": 1572,
      "C3)cc1": 1573,
      "[C@@H]2O)": 1574,
      "c2cccc(C)": 1575,
      "C(=O)N[C@@H](Cc2ccccc2)": 1576,
      "C(C#N)": 1577,
      "c4c3": 1578,
      "C(Cl)": 1579,
      "CC[C@@H]4[C@@]5(C)CC": 1580,
      "OCCCC": 1581,
      "CCC)": 1582,
      "CC1CCCCC1)": 1583,
      "P(=O)([O-])": 1584,
      "COc1ccc(C(=O)": 1585,
      "CC(N": 1586,
      "c4ccccc4)cc3)": 1587,
      "5(C)": 1588,
      "S2": 1589,
      "c3ccc(Br)cc3)": 1590,
      "c2ccc([N+](=O)[O-])cc2)": 1591,
      "c2ccc(F)cc2)CC1": 1592,
      "C[C@H]4": 1593,
      "COc1c(": 1594,
      "c54)": 1595,
      "CCCCC3)": 1596,
      "NC(=O)[C@@H]1CCCN1C(=O)[C@H](": 1597,
      "Cc2ccccc2)CC1": 1598,
      "cc(Cl)": 1599,
      "[C@H]12": 1600,
      "C2=O)c1": 1601,
      "[C@@]1(": 1602,
      "Cc1[nH]": 1603,
      "cc1-": 1604,
      "CC(C)(O)": 1605,
      "Cc1o": 1606,
      ")N1CCC(": 1607,
      "nc2ccccc21": 1608,
      "Cn1c(": 1609,
      "C(=O)O)cc": 1610,
      "COc1cccc2": 1611,
      "S(=O)(=O)[O-])": 1612,
      "O=C(CSc1n": 1613,
      "CC[C@H]4": 1614,
      "C(=O)N2CCC(": 1615,
      "c1ccc(F)": 1616,
      "cc(C(=O)N": 1617,
      "c3ccc(F)": 1618,
      "NC(=O)c1ccccc1": 1619,
      "Cn2cn": 1620,
      "C(=O)c2ccccc2": 1621,
      "c3ccc(C(F)(F)F)cc3)": 1622,
      "c2ccc(Cl)cc2)CC1": 1623,
      "[C@](C)(O)": 1624,
      "c2C)cc1": 1625,
      "nc(SCC(=O)N": 1626,
      "ccc(N)": 1627,
      "3CC3)": 1628,
      "4)C2)": 1629,
      "c2c(F)cccc2": 1630,
      "c3ccc(N": 1631,
      "COC(": 1632,
      "CC(=O)OC": 1633,
      "N2CCN(C(=O)": 1634,
      "/N=N/": 1635,
      "c(=O)n(C": 1636,
      "CC=C(": 1637,
      "ncn2": 1638,
      "NC(=O)OCc1ccccc1)": 1639,
      "c(N)n": 1640,
      "OCCCO": 1641,
      "c(SCC(=O)N": 1642,
      "c1o": 1643,
      "c2nc(-c3ccccc3)": 1644,
      "c4ccncc": 1645,
      ")ccn1": 1646,
      "c1ccc(Cl)": 1647,
      "[C@H](Cc1ccccc1)": 1648,
      "CC3)cc1": 1649,
      "CCc1ccccc1)": 1650,
      "CC(C(=O)N": 1651,
      "[n+]([O-])": 1652,
      "c2cccc([N+](=O)[O-])": 1653,
      "/C1=C\\": 1654,
      "n2c1": 1655,
      "Br)cc(": 1656,
      "/C=C/C(=O)O": 1657,
      "c2ccc(F)cc2)cc1": 1658,
      "n1C": 1659,
      "SC": 1660,
      "c2cc(N3": 1661,
      "c2cc(Cl)ccc2": 1662,
      "c3c(Cl)cc": 1663,
      "c2ccc(C)cc": 1664,
      "nc1N": 1665,
      "CCOCCOCCOCCO": 1666,
      "C)c1": 1667,
      "c4ccc5c(": 1668,
      "c4ccc(-": 1669,
      "c1ccco1)": 1670,
      "c3ccc(Cl)c(Cl)": 1671,
      "[C@@H]1C": 1672,
      "CCNCC1": 1673,
      "c2cccc(O": 1674,
      "c4cc5": 1675,
      "CN(C)S(=O)(=O)": 1676,
      "c3ccc(NC(=O)": 1677,
      "c(OC": 1678,
      "n(-c2ccccc2)": 1679,
      "c34)cc": 1680,
      "n2C": 1681,
      "[C@H]1CC[C@H]2[C@@H]3": 1682,
      "CC2=O)": 1683,
      "c1ccc2c(c1)OCO2": 1684,
      "C(C(=O)O)": 1685,
      "[nH]3)": 1686,
      "C2)CC1": 1687,
      "CCCCN(": 1688,
      "c2ccc(C(F)(F)F)cc2)": 1689,
      "[C@@H]7": 1690,
      "C(=O)O1": 1691,
      "c4ccccc4)CC3)": 1692,
      "Oc2ccc(": 1693,
      "CCCN(C)C)": 1694,
      "CC3CC(CC(C": 1695,
      "c2cc(OC)": 1696,
      "CCc3ccccc3": 1697,
      "CC2)ccc1": 1698,
      "CCCCn1": 1699,
      "c2ccccc2c1)": 1700,
      "C[C@@H]1CN(": 1701,
      "e]": 1702,
      "c2cccnc2": 1703,
      "n1-c1ccccc1": 1704,
      "C[N+]": 1705,
      "/C=C1\\": 1706,
      "(Cc2ccccc2)": 1707,
      "c1Cl": 1708,
      "cccc4": 1709,
      "c1nc(N)": 1710,
      "CCCC4)": 1711,
      "c(Cl)c3)": 1712,
      "CCC3(CC2)": 1713,
      "3)cc(": 1714,
      "CN(C)c1ccc(": 1715,
      "c(O)c(": 1716,
      "C1O": 1717,
      "O=C1c2ccccc2": 1718,
      "C(=O)NC1": 1719,
      "CCN(C)CC3)": 1720,
      "nn12": 1721,
      "C(=O)N[C@@H]1": 1722,
      "OCc1ccccc1": 1723,
      "[C@@H](NC(=O)": 1724,
      "C(=O)N(C)C)": 1725,
      "C(C)(C)O)": 1726,
      "c2=O)c1": 1727,
      "CC3CC(CC(C3)C1)": 1728,
      "N[C@H](": 1729,
      "C[C@@H](O": 1730,
      "n5": 1731,
      "C(C)(C)C)cc1": 1732,
      "COc1cc(N": 1733,
      "Cl)c1)": 1734,
      "C=CC(=O)N": 1735,
      "c3ccs": 1736,
      "n2cc(-": 1737,
      "c4)cc": 1738,
      "(F)(F)F)": 1739,
      "c4ccc(O)cc": 1740,
      "C(O)(": 1741,
      "CC5": 1742,
      "nn1)": 1743,
      "c1cn(-": 1744,
      "CCCO1": 1745,
      "c1nc(-c2ccccc2)": 1746,
      "C5)": 1747,
      "C3=N": 1748,
      "c2c1=O": 1749,
      "[C@@]23": 1750,
      "N)cc1": 1751,
      "CC(O": 1752,
      "c3cccc4cccc": 1753,
      "CCC(CC)": 1754,
      "C(O)C(O)": 1755,
      "CCCCCCCC(=O)": 1756,
      "c4ccco": 1757,
      "n(-c3ccccc3)": 1758,
      "Br)c1": 1759,
      "S(=O)(=O)c1ccccc1": 1760,
      "COC(=O)c1ccc(": 1761,
      "c1cc2cc(": 1762,
      "N1CCOCC1": 1763,
      "CO1": 1764,
      "C(=O)OCC": 1765,
      "c(CN": 1766,
      "2)c1C": 1767,
      "OC[C@H]3O[C@@H](": 1768,
      "c3cc(Cl)ccc3": 1769,
      "c4c3)": 1770,
      "NC(=O)c1cc(": 1771,
      "c(NC": 1772,
      "c2no": 1773,
      "C3=": 1774,
      "C(=O)C2": 1775,
      "ccc23)": 1776,
      "Cc1nn(C)": 1777,
      "O=C(CN1": 1778,
      "c2ccccc2c1=O": 1779,
      "c2cc1O": 1780,
      "2)cc1OC": 1781,
      "=C1/": 1782,
      "CCCCCCN": 1783,
      "NC(=O)[C@H]1": 1784,
      "c1cncc(": 1785,
      "c1ncccc1": 1786,
      "NC(=O)[C@H]([C@@H](C)O)": 1787,
      "c2nccc(": 1788,
      "c2cncc": 1789,
      "CCn1c(=O)": 1790,
      "NC(=O)/C=C/": 1791,
      "c1cccc2ccccc12)": 1792,
      "Cc2c(": 1793,
      "C(=O)N[C@H](C)": 1794,
      "cc2c(": 1795,
      "=[N-]": 1796,
      "[C@H](C)C[C@H](": 1797,
      "4)ccc3": 1798,
      "c3cs": 1799,
      "c1ccc(-c2ccc(": 1800,
      "O=C(O": 1801,
      "O[C@@H](C)": 1802,
      "=N)": 1803,
      "c1ccccc1Cl)": 1804,
      "CC3)cc2)": 1805,
      "CCCCCC1": 1806,
      "CCc2ccccc2)": 1807,
      "c2ccccc21)": 1808,
      "OCCO2": 1809,
      "Nc1cc": 1810,
      "5)cc4)": 1811,
      "c1ccc(S(=O)(=O)N": 1812,
      "O=C(N/N=C/": 1813,
      "B(O)": 1814,
      "c2co": 1815,
      "CSSC[C@@H](": 1816,
      "c3ncccc3": 1817,
      "[C@]23": 1818,
      "c1ccc(Cl)c(Cl)c1": 1819,
      "CC[C@]1": 1820,
      "SC)": 1821,
      "C(CO)": 1822,
      "c3ccc4": 1823,
      "CC[C@]2(": 1824,
      "Cc1s": 1825,
      "NC(=O)[C@H](C(C)C)": 1826,
      "C3=C(": 1827,
      "C2CC3": 1828,
      "c[nH]1": 1829,
      "C[C@H]1CN(": 1830,
      "OCc2ccccc2)": 1831,
      "c3cccc(C(F)(F)F)c3)": 1832,
      "c2s1": 1833,
      "CC1CCN(": 1834,
      "CC(=O)N(C)": 1835,
      "c(=O)c2c1": 1836,
      "nc2)": 1837,
      "c3c(O)": 1838,
      "Cc1cccnc1": 1839,
      "NC(=O)[C@H](CCCN=C(N)N)": 1840,
      "CCNC(=O)N": 1841,
      "Cc1c(C(=O)N": 1842,
      "cc1Cl": 1843,
      "CC[C@@H](O)": 1844,
      "CC2CCCCC2)": 1845,
      "c(N)ncn": 1846,
      "S)=N": 1847,
      "Cc1ccc(S(=O)(=O)N2": 1848,
      "CCN2C(=O)": 1849,
      "c(F)cc": 1850,
      "Clc1ccc(": 1851,
      "c2c(c1": 1852,
      "c(F)cc2": 1853,
      "Cc1nc(N": 1854,
      "COc2ccc(": 1855,
      "c(F)c2)": 1856,
      "NC(=O)C": 1857,
      "c3cccc(C)": 1858,
      "COc1ccc2[nH]": 1859,
      "CC1=N": 1860,
      "/N=C1\\": 1861,
      "CCN1CCC(": 1862,
      "c1ccccc1F": 1863,
      "Cc1noc(C)c1": 1864,
      "c1cc(=O)": 1865,
      "CC1CC1)": 1866,
      "=[N+]=[N-]": 1867,
      "c(-c2ccc(": 1868,
      "C(=O)N[C@@H](CCCCN)C(=O)N[C@@H](CCCCN)": 1869,
      "c3c2)cc1": 1870,
      "CC4CC(CC(C": 1871,
      "c2cc(Br)cc": 1872,
      "c4cc(Cl)cc": 1873,
      "C3CCCC3)": 1874,
      "CCn1c(": 1875,
      "[Si](C)": 1876,
      "c2cnn3": 1877,
      "nc3c(": 1878,
      "s2)c1": 1879,
      "c1ccc(F)cc1F": 1880,
      "CCCN(CCC)": 1881,
      "c1cccs1)": 1882,
      "c2c(Cl)cccc2": 1883,
      "c2ccnc(N": 1884,
      "/C=C(/": 1885,
      "c2ccc(Br)cc2": 1886,
      "CCN(CC)C(=O)": 1887,
      "[C@]3(C)": 1888,
      "c2cccc(OC)": 1889,
      "NC(=O)N1": 1890,
      "c2n[nH]": 1891,
      "[nH]2)cc1": 1892,
      "c5[nH]": 1893,
      "[C@H]7": 1894,
      "C(=O)NS(=O)(=O)": 1895,
      "(OC)": 1896,
      "c2ccc(F)cc2F)": 1897,
      "cn2)cc1": 1898,
      "o2)c1": 1899,
      "c%1": 1900,
      "c2ccc(Cl)c(Cl)c2)": 1901,
      "c1ccc(O)c(O)": 1902,
      "c1cc(-c2ccccc2)": 1903,
      "CCl)": 1904,
      "=S": 1905,
      "c2ccc(O)cc2": 1906,
      "c4cccc5": 1907,
      "Cl.Cl": 1908,
      "CCCN(C)": 1909,
      "C(C(=O)": 1910,
      "CC[C@H]1OC(=O)": 1911,
      "OCCN": 1912,
      "[C@@H]2C1": 1913,
      "3)ccc21": 1914,
      "c2cccc3c2": 1915,
      "nn(C)": 1916,
      "nc1C": 1917,
      "c(n2)": 1918,
      "c3F)": 1919,
      "OCO2)": 1920,
      "OP(=O)(O)": 1921,
      "[C@@H](C": 1922,
      "(C#": 1923,
      "(CCO)": 1924,
      "[C@]3(C)CC": 1925,
      "C(NC(=O)": 1926,
      "C3)cc2": 1927,
      "[C@@](C)": 1928,
      "CC1(C)C": 1929,
      "CCC(F)(F)": 1930,
      "[C@@H]1O)": 1931,
      "c3cc4cccc": 1932,
      "C(F)(F)F)cc2": 1933,
      "Cc1c(C)": 1934,
      "COC": 1935,
      "CCN(CC(=O)N": 1936,
      "c1ccccc1)N1": 1937,
      "c3cccc(-": 1938,
      "Cc1ccc(-c2ccccc2": 1939,
      "Fc1ccc(": 1940,
      "C1(C)C": 1941,
      "c1cc(C(=O)N": 1942,
      "Nc1nc(N": 1943,
      "n3cc": 1944,
      "CC(F)(F)F)": 1945,
      "oc(=O)": 1946,
      "c4ncc": 1947,
      "CCOC)": 1948,
      "c2o1": 1949,
      "Cc1ccc(-n2": 1950,
      "CC4CC(CC(C4)C2)": 1951,
      "c4cccc(Cl)": 1952,
      "n3cc(": 1953,
      "Oc1ccccc1": 1954,
      "C3(": 1955,
      "c3c(F)cccc3": 1956,
      "nnc1": 1957,
      "CN(S(=O)(=O)": 1958,
      "cc5": 1959,
      "Cc1ccco1": 1960,
      "4C)": 1961,
      "n2)C1": 1962,
      "C21": 1963,
      "c1ccc2o": 1964,
      "NC1=N": 1965,
      "COC(=O)[C@H](": 1966,
      "c1ccc(O)": 1967,
      "Cn2cc(": 1968,
      "c(C(N)=O)": 1969,
      "CC[C@H](C)[C@@H]1": 1970,
      "nc3ccccc3": 1971,
      "N1CCN(C(=O)": 1972,
      "CCn2": 1973,
      "c8": 1974,
      "c3n2)cc1": 1975,
      "CC(C)(C)C)": 1976,
      "C=C(C)[C@@H]1": 1977,
      "c1ccc(O)cc1)": 1978,
      "NC(=O)[C@H](Cc2ccc(O)cc2)": 1979,
      "c3ccc(Cl)c(Cl)c3)": 1980,
      "c1F": 1981,
      "c2c(N": 1982,
      "C(=O)N[C@@H](CCCNC(=N)N)C(=O)N[C@@H](CCCNC(=N)N)": 1983,
      "c5cn": 1984,
      "c1cc(Cl)": 1985,
      "nc3)": 1986,
      "n[nH]1": 1987,
      "C(c1ccccc1)": 1988,
      "c(=O)n(-": 1989,
      "c1-c1ccccc1": 1990,
      "COP(=O)(": 1991,
      "[C@]5": 1992,
      "c2ncccn": 1993,
      "n(CC(=O)N": 1994,
      "[n+](C)": 1995,
      "C(F)(F)C(F)(F)": 1996,
      "C(=O)N2CC": 1997,
      "c2ccncc2": 1998,
      "c3nc(N": 1999,
      "c1ccc(Cl)cc1Cl": 2000,
      "cs2)": 2001,
      "c3cco": 2002,
      "CO2": 2003,
      "ccc2c1": 2004,
      "NC(=O)c1cn": 2005,
      "C2(C)C)": 2006,
      "c3c[nH]c4ccccc34)": 2007,
      "c3ccccc3-": 2008,
      "c3cc(OC)c(OC)c(OC)": 2009,
      "(OC(C)=O)": 2010,
      "c3ccc([N+](=O)[O-]": 2011,
      "CC=C(C)C)": 2012,
      "CNC(=O)[C@H](": 2013,
      "c6ccc(": 2014,
      "c2ccc(-c3ccccc3)cc2)": 2015,
      "c1cccc(Cl)c1)": 2016,
      "N=": 2017,
      "c21)": 2018,
      "O=C(COC(=O)": 2019,
      "C1=C(O)": 2020,
      "ccc1O": 2021,
      "C(=O)N(C)[C@@H](": 2022,
      "c4ccc5c(c4)": 2023,
      "ncnc(N": 2024,
      "c1c(N": 2025,
      "cc(N": 2026,
      "c3ccccc3)CC2)cc1": 2027,
      "c(=S)": 2028,
      "C(C)C)c1": 2029,
      "[C@](C)": 2030,
      "c2cccc(Br)": 2031,
      "CC[C@]3(C)[C@H](": 2032,
      "(F)F)": 2033,
      "c2ccc3c(c2)OCCO": 2034,
      "C3(C)C)": 2035,
      "c4ccccc4)cc": 2036,
      "Cc1ccncc1": 2037,
      "c3cc(OC)": 2038,
      "c1ccc(Br)cc1)": 2039,
      "C(=O)N[C@@H](Cc1cnc[nH]1)": 2040,
      "NC(=O)[C@H](Cc1cnc[nH]1)": 2041,
      "[C@H](C)[C@@H](O)": 2042,
      "c2cnc(N": 2043,
      "CC(C)C": 2044,
      "c([N+](=O)[O-])c1": 2045,
      "c1co": 2046,
      "CSSC[C@H](": 2047,
      "CC(C)=CCC": 2048,
      "NS(=O)(=O)c1ccc(": 2049,
      "CCCC[C@@H]1": 2050,
      "c2cn(-": 2051,
      "C(=O)N[C@H](C(=O)N[C@H](": 2052,
      "COc1ccccc1N1CCN(": 2053,
      "C(=O)NO)": 2054,
      "Cc2n": 2055,
      "n4cnc5": 2056,
      "CC[C@@H]12": 2057,
      "c1ccncc1)": 2058,
      "(C4": 2059,
      "COc1ccc(CN": 2060,
      "[C@H](C)C[C@H](N(C)C)": 2061,
      "CC1CC1": 2062,
      "c1ncc(-": 2063,
      "/C(=N/O)": 2064,
      "c2cc(Cl)": 2065,
      "/C=C3": 2066,
      "nc(N2": 2067,
      "CN1CC": 2068,
      "[C@@H](O)[C@H]1O": 2069,
      "N=C(N": 2070,
      "C2(C)C": 2071,
      "COc1cccc2c1": 2072,
      "c5c4": 2073,
      "c3)cc2)": 2074,
      "[C@H]1O)": 2075,
      "c1cn2": 2076,
      "Cc1cccc(C)c1": 2077,
      "CCCCC4)": 2078,
      "cccn3)": 2079,
      "COc1ccc(CNC(=O)": 2080,
      "C6": 2081,
      "=C(N": 2082,
      "Cc1cc(NC(=O)": 2083,
      "NC(=O)[C@H](Cc2c[nH]c3ccccc23)": 2084,
      "c2ccc(S(N)(=O)=O)": 2085,
      "c2cco": 2086,
      "3)cc2)CC1": 2087,
      "CCNCC2)": 2088,
      "C[C@H](OC(=O)": 2089,
      "(CO": 2090,
      "CC(=O)N[C@H](": 2091,
      "C[C@H](N": 2092,
      "c23)CC1": 2093,
      "c2cccnc2)cc1": 2094,
      "2)c1=O": 2095,
      "c2cn3": 2096,
      "[C@@H]1CCCN1": 2097,
      "c[nH]2)": 2098,
      "c4ccccn4)": 2099,
      "c2ccc(C#N": 2100,
      "nc(SC": 2101,
      "Cl)cc3": 2102,
      "c3ccc([N+](=O)[O-])cc3)": 2103,
      ")N(C": 2104,
      "c1-2": 2105,
      "c1cc(NC(=O)": 2106,
      "CC(=O)N[C@H]1": 2107,
      "C(=O)O)c1": 2108,
      "c2cccc(NC(=O)": 2109,
      "CCC(C(=O)N": 2110,
      "N=C2": 2111,
      "CN(C)C": 2112,
      "CCC1)": 2113,
      "COCCN1": 2114,
      "[C@H](C)O": 2115,
      "c1cc(F)": 2116,
      "[C@@H](OC)": 2117,
      "4)c3)": 2118,
      "[C@@H](C)CO)": 2119,
      "nc2)cc1": 2120,
      "CC1CCCCC1": 2121,
      "c2ccc(-c3n": 2122,
      "c2ccc([N+](=O)[O-])cc2": 2123,
      "nc32)": 2124,
      "C(C)=C(": 2125,
      "c3ccc(Cl)": 2126,
      "CCC(N": 2127,
      "c4cccc(F)": 2128,
      "c3ccc(C#N": 2129,
      "c2cc(C(F)(F)F)cc": 2130,
      "c1nnn": 2131,
      "/C(C#N)": 2132,
      "[C@@H]2C": 2133,
      "n3C)": 2134,
      "CCCC2)cc1": 2135,
      "C1CC1)": 2136,
      "C(=O)N2CCC[C@H]2": 2137,
      "Cc1ccc(O)cc1": 2138,
      "CC(=O)N(C": 2139,
      "oc1": 2140,
      "C/C=C\\C/C=C\\": 2141,
      "c2c1cc": 2142,
      "[nH]n1": 2143,
      "C(O": 2144,
      "O=C(NO)": 2145,
      "[C@@H](C)CC": 2146,
      "(c1ccccc1)": 2147,
      "Cn1nc(": 2148,
      "NC1=O)": 2149,
      "O=C(CC": 2150,
      "c23)c1": 2151,
      "[C@H](C)[C@@H](O[C@@H]2O": 2152,
      "C[C@H](CO)": 2153,
      "n2)n1": 2154,
      "CC1=O": 2155,
      "C(=O)NC2": 2156,
      "2H]": 2157,
      "[nH]c(-": 2158,
      "C[C@@](C)(": 2159,
      "CC[C@]4(C)[C@H]3CC[C@]12C": 2160,
      "nc23)": 2161,
      "COc1ccc(O": 2162,
      "CCN(C)CC2)": 2163,
      ")N1CCOCC1": 2164,
