{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [],
  "normalizer": null,
  "pre_tokenizer": null,
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "vocab": {
      "#": 0,
      "%": 1,
      "(": 2,
      ")": 3,
      "*": 4,
      "+": 5,
      "-": 6,
      ".": 7,
      "/": 8,
      "0": 9,
      "1": 10,
      "2": 11,
      "3": 12,
      "4": 13,
      "5": 14,
      "6": 15,
      "7": 16,
      "8": 17,
      "9": 18,
      "=": 19,
      "@": 20,
      "A": 21,
      "B": 22,
      "C": 23,
      "D": 24,
      "E": 25,
      "F": 26,
      "G": 27,
      "H": 28,
      "I": 29,
      "K": 30,
      "L": 31,
      "M": 32,
      "N": 33,
      "O": 34,
      "P": 35,
      "R": 36,
      "S": 37,
      "T": 38,
      "U": 39,
      "V": 40,
      "W": 41,
      "X": 42,
      "Y": 43,
      "Z": 44,
      "[": 45,
      "\\": 46,
      "]": 47,
      "a": 48,
      "b": 49,
      "c": 50,
      "d": 51,
      "e": 52,
      "f": 53,
      "g": 54,
      "h": 55,
      "i": 56,
      "k": 57,
      "l": 58,
      "m": 59,
      "n": 60,
      "o": 61,
      "p": 62,
      "r": 63,
      "s": 64,
      "t": 65,
      "u": 66,
      "y": 67,
      "cc": 68,
      "CC": 69,
      "(C": 70,
      "O)": 71,
      "c1": 72,
      "=O)": 73,
      "(=O)": 74,
      "ccc": 75,
      "(C)": 76,
      "c2": 77,
      "H]": 78,
      "C(=O)": 79,
      "[C": 80,
      "[C@": 81,
      ")cc": 82,
      "CCCC": 83,
      "c(": 84,
      "c1cc": 85,
      "C(": 86,
      "c3": 87,
      "c1ccc": 88,
      "F)": 89,
      "ccccc": 90,
      "C1": 91,
      "2)": 92,
      "[C@@": 93,
      "OC": 94,
      "[C@H]": 95,
      "[C@@H]": 96,
      "CCC": 97,
      "(C)C": 98,
      "c1cccc": 99,
      "=C": 100,
      ")cc1": 101,
      "(N": 102,
      "CCN": 103,
      "CC1": 104,
      "CO": 105,
      "(C(=O)": 106,
      "(F)": 107,
      "3)": 108,
      "c2ccc": 109,
      "n1": 110,
      "(-": 111,
      "CN": 112,
      "C(=O)N": 113,
      "c4": 114,
      "(Cl": 115,
      "c1ccccc1": 116,
      "c2cc": 117,
      "c2ccccc": 118,
      "(O)": 119,
      "CCO": 120,
      "cn": 121,
      "CC(=O)": 122,
      "N)": 123,
      "=C(": 124,
      "C=C": 125,
      "-]": 126,
      "c1n": 127,
      "S(=O)": 128,
      "NC(=O)": 129,
      "CC(C)": 130,
      "(C)C)": 131,
      "[n": 132,
      "C2": 133,
      "S(=O)(=O)": 134,
      "c1ccc(": 135,
      "+]": 136,
      "[nH]": 137,
      "(Cl)": 138,
      "c(-": 139,
      "N1": 140,
      "c3ccccc": 141,
      "c3ccc": 142,
      "(CC": 143,
      "CCCCCCCC": 144,
      "Br": 145,
      "Cl": 146,
      "/C=C": 147,
      "c2ccccc2": 148,
      "NC": 149,
      "[N": 150,
      "[O": 151,
      "[O-]": 152,
      "cc1": 153,
      "n2": 154,
      "4)": 155,
      "c(C)": 156,
      "c(C": 157,
      "OC)": 158,
      "c2n": 159,
      "c2)": 160,
      "c5": 161,
      "C(C)": 162,
      "(C(=O)N": 163,
      "O=C(": 164,
      "cccc": 165,
      "c2ccccc2)": 166,
      "[N+]": 167,
      "(O": 168,
      "c1)": 169,
      ")cc2": 170,
      "c2cccc": 171,
      "C)": 172,
      "CC2": 173,
      "C=": 174,
      "[C@@H]1": 175,
      "[C@H]1": 176,
      "=O": 177,
      "CC(=O)N": 178,
      "C(F)": 179,
      "c1ccc(C": 180,
      "(NC(=O)": 181,
      "(N)": 182,
      "c3ccccc3": 183,
      "F)cc": 184,
      "(F)(F)": 185,
      "c1ccc2": 186,
      "c(N": 187,
      "CCC(": 188,
      "CCCN": 189,
      "=N": 190,
      "Br)": 191,
      "C(=O)O": 192,
      "Cc1cc": 193,
      "CC2)": 194,
      "/C=C\\": 195,
      "1)": 196,
      "[O-])": 197,
      "c(=O)": 198,
      "c1ccccc1)": 199,
      "c1ccc(-": 200,
      "c4ccccc": 201,
      "C(F)(F)": 202,
      "OC(C)": 203,
      "c2ccc(": 204,
      "[N+](=O)": 205,
      "ccc2": 206,
      "[C@@H]2": 207,
      "[C@H]2": 208,
      "c3cc": 209,
      "c3)": 210,
      "CCN(": 211,
      "c1cn": 212,
      "(C(=O)O)": 213,
      "c3ccccc3)": 214,
      ")cc2)": 215,
      "CC(C)(C)": 216,
      "nc1": 217,
      "OC(=O)": 218,
      "O=": 219,
      "CC)": 220,
      "[S": 221,
      "[C@]": 222,
      "#N)": 223,
      "COC(=O)": 224,
      "c6": 225,
      "N2": 226,
      "c4ccc": 227,
      "C3": 228,
      "/C=C/": 229,
      "(CO)": 230,
      "cc2": 231,
      "c1ccc(N": 232,
      ".[": 233,
      "Cl)": 234,
      "CCC1": 235,
      "[C@@]": 236,
      "C2)": 237,
      "c(F)": 238,
      "(F)(F)F)": 239,
      "c(Cl)": 240,
      ".C": 241,
      ")ccc1": 242,
      "n2)": 243,
      "C/C=C\\": 244,
      "C(O)": 245,
      ")cc1)": 246,
      "CN1": 247,
      "n3": 248,
      "nc2": 249,
      "[C@@H](": 250,
      "5)": 251,
      "nc(-": 252,
      "cs": 253,
      "C[C@H]": 254,
      "(CC)": 255,
      "2H]": 256,
      "CCOC(=O)": 257,
      "c4ccccc4": 258,
      "c3cccc": 259,
      "c1cc(": 260,
      "C(=O)N1": 261,
      "Cc1n": 262,
      "OCC": 263,
      "=S": 264,
      "(C(C)": 265,
      "[C@@H](O)": 266,
      "c1ccc2c(": 267,
      "2)cc1": 268,
      "CC(": 269,
      "CS": 270,
      "[2H]": 271,
      "[C@@H](C)": 272,
      "[Si": 273,
      "CC3)": 274,
      "[C@H](O)": 275,
      "C(C": 276,
      "c3n": 277,
      "(Cl)cc": 278,
      "C(N)": 279,
      "=C(C": 280,
      "c2c(": 281,
      "c2ccc3": 282,
      "[C@H](C)": 283,
      "CC3": 284,
      "c5ccccc": 285,
      "CCC(C)": 286,
      "CCCO": 287,
      "[Si]": 288,
      "CCCCC1": 289,
      "[C@H](": 290,
      "CCN(C(=O)": 291,
      "C(=O)O)": 292,
      "CCN1": 293,
      "c1ccc2c(c1)": 294,
      "O=C(O)": 295,
      "s1": 296,
      "CC1)": 297,
      "cn1": 298,
      "O=C(N": 299,
      "Cc1": 300,
      "[N+](=O)[O-]": 301,
      "F)cc1": 302,
      "CCCC1": 303,
      "[N+](=O)[O-])": 304,
      "S(=O)(=O)N": 305,
      "[C@@H](C": 306,
      "[C@H](C": 307,
      "=S)": 308,
      "ccc3": 309,
      "c3ccc(": 310,
      "c2c1": 311,
      "[2H])": 312,
      "c12": 313,
      "nc(": 314,
      "C(C)C": 315,
      "CCN(C": 316,
      "/C(": 317,
      "c2cn": 318,
      "o1": 319,
      "[C@@H]3": 320,
      "cc(-": 321,
      "2CCCC": 322,
      "N(": 323,
      ".Cl": 324,
      "(C(F)(F)F)": 325,
      "C/C=C\\C/C=C\\": 326,
      "2)c1": 327,
      "Cc1cccc": 328,
      "c1ccc(Cl": 329,
      "COc1cc": 330,
      "(OC)": 331,
      "(C)cc": 332,
      "(CN": 333,
      "nn": 334,
      "CN(": 335,
      "Cn1": 336,
      "C=C(": 337,
      "ncc": 338,
      "CC(C)C": 339,
      "CCC2": 340,
      "(Br)": 341,
      "P(=O)": 342,
      ")cc3": 343,
      ")cc3)": 344,
      "c(O)": 345,
      "CC(O)": 346,
      "c7": 347,
      "C1=O": 348,
      "Cc1ccc": 349,
      "c2ccc(-": 350,
      "CN(C)": 351,
      "c(N)": 352,
      "CCNC(=O)": 353,
      "C3)": 354,
      "CNC(=O)": 355,
      "O=C(C": 356,
      ")cc2)cc1": 357,
      "[C@H]3": 358,
      "c1C": 359,
      "CC(C": 360,
      "COc1ccc(": 361,
      "Cc1ccc(": 362,
      "N#": 363,
      "([O-])": 364,
      "O=C1": 365,
      ".CC": 366,
      "CCCCCCCCCCCCCCCC": 367,
      "c[nH]": 368,
      "CC(=O)O)": 369,
      "c4ccccc4)": 370,
      "c5ccccc5": 371,
      "c4)": 372,
      "(C)(=O)": 373,
      "=O)cc1": 374,
      "Cc1ccccc1": 375,
      "OC(C)(C)C)": 376,
      "N(C)": 377,
      "n(-": 378,
      "c2ccc(Cl": 379,
      "n1)": 380,
      "#N": 381,
      "ccccc6": 382,
      "CC(=O)O": 383,
      "n(C)": 384,
      "[Si](C)": 385,
      "c2)cc1": 386,
      "S(C)(=O)": 387,
      "=C/": 388,
      "c(OC)": 389,
      "c2ccc(C": 390,
      "C(C)(C)": 391,
      "NC1": 392,
      "c1ccc(Cl)cc1": 393,
      "c1cc2": 394,
      "CCn1": 395,
      "=C\\": 396,
      "C(F)(F)F": 397,
      "c3c(": 398,
      "N(C": 399,
      "c(C)c1": 400,
      "CCC(C": 401,
      "c2ccc(N": 402,
      "cc3": 403,
      "c1ncc": 404,
      "c3ccc4": 405,
      "CCOCCO": 406,
      ".[C": 407,
      "CCS": 408,
      "C(F)(F)F)": 409,
      "NC(C)": 410,
      "c5ccc": 411,
      "c6ccccc6": 412,
      "c1c(": 413,
      "c(C(=O)N": 414,
      "CCCN1": 415,
      "(N)=O)": 416,
      "3CCCC": 417,
      "C(=S)": 418,
      "CC2)cc1": 419,
      "C(=": 420,
      "OC1": 421,
      "nc3": 422,
      "n3)": 423,
      "n2)cc1": 424,
      "C1)": 425,
      "nc(N": 426,
      "COc1cccc": 427,
      "COc1ccc(C": 428,
      "CCC(=O)N": 429,
      "c2ccccc21": 430,
      "CC1(C)": 431,
      "c4cc": 432,
      "ncn": 433,
      "2)CC1": 434,
      "OC2": 435,
      "nc(C": 436,
      "C[C@@H]1": 437,
      "c1ccc(C)": 438,
      "=C1": 439,
      "c2ccc3c(": 440,
      "CCCCCCCCCCCC": 441,
      "c(=O)[nH]": 442,
      "C(C)C)": 443,
      "c4cccc": 444,
      "O1": 445,
      "C4": 446,
      "=CC": 447,
      "P(=O)(O)": 448,
      "[C@]1": 449,
      "2)C1": 450,
      "(C2": 451,
      "ccccc2": 452,
      "C[C@H]1": 453,
      "/N": 454,
      "C(C)(C)C": 455,
      "OCO": 456,
      "(C(=O)NC": 457,
      "C[C@@H]": 458,
      "c3ccc(-": 459,
      "n4": 460,
      "c2ccccc2)cc1": 461,
      "3)cc1": 462,
      "c1ccc(O": 463,
      "CN(C": 464,
      "[NH": 465,
      "=C2": 466,
      "CC(=O)N1": 467,
      "c1O": 468,
      "c1=O": 469,
      "c2cc3": 470,
      "c2ccc3c(c2)": 471,
      "c1ccc(-c2n": 472,
      "C#": 473,
      "c1-": 474,
      "C(=O)OC": 475,
      "c1cccc2": 476,
      "COC": 477,
      "CCC)": 478,
      "cc(": 479,
      "NC(=O)N": 480,
      "(C#N)": 481,
      "[n+]": 482,
      "CCN(C)": 483,
      "c1cc(-": 484,
      "Cc1ccc(C": 485,
      ".I": 486,
      "].[": 487,
      "CCCC(=O)": 488,
      "n(C": 489,
      "c1ccc(NC(=O)": 490,
      "I)": 491,
      "ncc1": 492,
      "C=C1": 493,
      ".CC(C)": 494,
      "c1ccc(F)cc1": 495,
      "s1)": 496,
      "(c2ccccc2)": 497,
      "[C@@]2": 498,
      "Br)cc1": 499,
      "(C)C(C)": 500,
      "[C@@]1": 501,
      "c2cc(-": 502,
      "/C=C(": 503,
      "c(Cl)cc": 504,
      "C1CC1": 505,
      "2CC": 506,
      "nn1": 507,
      "CC(C)(C)O": 508,
      "(OC": 509,
      "(C(=O)O": 510,
      "c-]": 511,
      "%1": 512,
      "s2)": 513,
      "OC(C)=O)": 514,
      "c2ccc(F)cc": 515,
      "c3cn": 516,
      "F)cc2": 517,
      "CN(C(=O)": 518,
      "(CCCC": 519,
      "S(C)(=O)=O)": 520,
      "[nH]1": 521,
      "2C": 522,
      "Nc1n": 523,
      "c(O": 524,
      "(C(C)(C)C)": 525,
      "COc1ccccc1": 526,
      "CCN(CC)": 527,
      "ccc4": 528,
      "=C(N)": 529,
      "c2s": 530,
      "CC(N": 531,
      "CC4)": 532,
      "c2)c1": 533,
      "(OC(=O)": 534,
      "C2=O)": 535,
      "c1ccc(C(=O)N": 536,
      "6)": 537,
      "C=N": 538,
      "NCC": 539,
      "OCCO": 540,
      "CC4": 541,
      "c(F)c1": 542,
      "c1ccc(Cl)": 543,
      "[C@]2": 544,
      "ccccc7": 545,
      "CCN(CC": 546,
      "C(=O)N(": 547,
      "c2ccc(Cl)cc2)": 548,
      "c(Br)": 549,
      "(F)(F)F)cc": 550,
      "no": 551,
      "c1ccc(C)cc1": 552,
      "(F)cc": 553,
      "c(NC(=O)": 554,
      "c(S": 555,
      "(C)O": 556,
      "ccccc3": 557,
      "c2ccccc2-": 558,
      "C(=N": 559,
      "C2CCCC": 560,
      "CCC3": 561,
      "2C(=O)": 562,
      "CCOC": 563,
      "CCCN(": 564,
      "c(C)cc": 565,
      "([N+](=O)[O-])": 566,
      "=C)": 567,
      "c8": 568,
      "c3ccc(F)cc": 569,
      "C2)cc1": 570,
      ".O": 571,
      "[C@H](CO)": 572,
      "c(Cl)c1": 573,
      "[c-]": 574,
      "N1C(=O)": 575,
      "C=CC": 576,
      "[C@H]1O": 577,
      "CO)": 578,
      "(CO": 579,
      "c1ccc(OC": 580,
      "C1CCCCC1": 581,
      "([2H])": 582,
      "c1ccc(O)": 583,
      "ccc21": 584,
      "NS(=O)(=O)": 585,
      "Cc1cn": 586,
      "CC2)c1": 587,
      "c2ncc": 588,
      "CCOCC1": 589,
      "CN=C(": 590,
      "c2cccc3": 591,
      "c4ccc5": 592,
      ")cc4": 593,
      "OC(C)(C)C": 594,
      "n(": 595,
      "c1OC": 596,
      "c3ccc(Cl)cc": 597,
      "C(C)(C)C)": 598,
      "c7ccccc7": 599,
      "c1ccc(-n2": 600,
      "CC#": 601,
      ")cc(-": 602,
      "c1s": 603,
      "c2ccc(O": 604,
      "c1cc(N": 605,
      "[C@@H]4": 606,
      "nc(C)": 607,
      "c2ccc(OC": 608,
      "c1cc(C": 609,
      "l)": 610,
      "c5ccccc5)": 611,
      "[C@H](NC(=O)": 612,
      "[C@@H](CC": 613,
      "COc1cc(": 614,
      "=C(C)": 615,
      "Cc1cc(C)": 616,
      "CCc1n": 617,
      "2]": 618,
      "O=S(=O)": 619,
      "c(OC": 620,
      "C[C@H]2": 621,
      "c3ccc4c(": 622,
      "c2ccc(F)cc2)": 623,
      "C(=O)N2": 624,
      "F)cc1)": 625,
      "(Cl)c1": 626,
      "/C(=C\\": 627,
      "[S+]": 628,
      "CCS(=O)(=O)": 629,
      "CCCNC(=O)": 630,
      "N3": 631,
      "CCCCC": 632,
      "[C@@H](O": 633,
      "c2ccc(C)": 634,
      "(C(C)C)": 635,
      "[C@H](CC": 636,
      "[C@@H]1O": 637,
      "N(C)C": 638,
      "(C(C)(C)C": 639,
      "(c1ccccc1)": 640,
      "n[nH]": 641,
      "Cc1ccc(N": 642,
      "C(=NC": 643,
      "CCC(O)": 644,
      "c(C(C)": 645,
      "c1.": 646,
      "CC(=O)NC": 647,
      "nc2)": 648,
      "(N(": 649,
      "[NH+]": 650,
      "C)cc1": 651,
      "c3ccccc2": 652,
      "c2ccccc12": 653,
      "(C)CC": 654,
      "c12)": 655,
      "N(C(=O)": 656,
      "o2)": 657,
      ")cc4)": 658,
      "C#N)": 659,
      "[C@@H](NC(=O)": 660,
      "CC(N)": 661,
      "CCCCO": 662,
      "COC1": 663,
      "CC(CC": 664,
      "/C=C(\\": 665,
      "c(C(=O)O)": 666,
      "c(F)c(F)": 667,
      "C=C(C)": 668,
      "S(=O)(=O)N2": 669,
      "o1)": 670,
      "C(CC": 671,
      "CCCC2": 672,
      "c1ccc(F)": 673,
      ")cc21": 674,
      "n1-": 675,
      "c2cc(Cl)": 676,
      "s3)": 677,
      "c1cs": 678,
      "CCCCCC": 679,
      "C[C@@H]2": 680,
      "cccc2": 681,
      "c3ccc4c(c3)": 682,
      "C(N)=O)": 683,
      "c2=O)": 684,
      "ncc2": 685,
      "ccc1": 686,
      "c2nc(-": 687,
      ".[N": 688,
      "c1cccc(-": 689,
      "l-]": 690,
      "CS(=O)(=O)": 691,
      "[C@H]4": 692,
      "(C)c1": 693,
      "c(C(=O)": 694,
      "CCOCC2)": 695,
      "(C)C)cc1": 696,
      "c2cccc(Cl)": 697,
      "c3ccc(C": 698,
      "S(=O)(=O)O)": 699,
      "c1nc(-": 700,
      "c(C(F)(F)F)": 701,
      "cc4": 702,
      ".[Cl-]": 703,
      "C(F)(F)C(F)(F)": 704,
      "(F)c1": 705,
      "c21": 706,
      "C(=S)N": 707,
      "ccc(-": 708,
      ".CC.CC": 709,
      "sc1": 710,
      "c5)": 711,
      "[C@H](O": 712,
      ".O=C(O)": 713,
      "cs1": 714,
      "/C=N": 715,
      ".C.C": 716,
      "c(cc1": 717,
      "c4ccc(-": 718,
      "NCC1": 719,
      "c1c(C)": 720,
      "c2cc(C)": 721,
      "/C=C\\C/C=C\\C/C=C\\": 722,
      "c3ccc(F)cc3)": 723,
      "c2ccc(Br": 724,
      "c2)CC1": 725,
      "cc2)": 726,
      "cc(C": 727,
      "c2ncn": 728,
      "c2ccc(Cl)": 729,
      "[nH]c(=O)": 730,
      "c([2H])": 731,
      "N=C": 732,
      "CN1C(=O)": 733,
      "OC(": 734,
      "c3cccc4": 735,
      "CCCC(C)": 736,
      "[N-]": 737,
      "c1cccnc1": 738,
      "[N+](C)": 739,
      "c(C#N)": 740,
      "(CN)": 741,
      "n2)c1": 742,
      ".CO": 743,
      "a+]": 744,
      "CCCN(C(=O)": 745,
      "c1ncn": 746,
      "N(C)C(=O)": 747,
      "co": 748,
      "[N+](=O)[O-])cc1": 749,
      "CCC(=O)": 750,
      "[C@]3": 751,
      "c2c(C)": 752,
      "(Cl)ccc1": 753,
      "c3cc(-": 754,
      "N1CC": 755,
      "SC": 756,
      "c1c[nH]": 757,
      "3CCO": 758,
      "c1ccc(Cl)cc1)": 759,
      "c2n1": 760,
      "CCCCCCC": 761,
      "c1ccc(N2": 762,
      "/C(=C/": 763,
      "-]#": 764,
      "c1ccc(F)cc1)": 765,
      ".N": 766,
      ".[Na+]": 767,
      "ccccc4": 768,
      "c2ccc(Cl)cc2": 769,
      "c1ccc(C2": 770,
      "C(CC)": 771,
      "c4c(": 772,
      "CC(C)(C)C": 773,
      "c1cc(F)cc": 774,
      "CCOC(=O)C1": 775,
      "no1": 776,
      ".[H": 777,
      "c1cccc(": 778,
      "c1ccc(Br)cc1": 779,
      "c(OC)c1": 780,
      "OC(CO)": 781,
      "CCC(N)": 782,
      "N=C(": 783,
      "c(C2": 784,
      "CCO)": 785,
      "CCN1C(=O)": 786,
      "nc12": 787,
      "c1cccc(N": 788,
      "n5": 789,
      "c2ccc(O)": 790,
      "c1ccccc1-": 791,
      "c1[nH]": 792,
      "[N+]([O-])": 793,
      "[C@@]3": 794,
      "c3cc4": 795,
      "CCN2": 796,
      "(CCC": 797,
      "NC(=O)C1": 798,
      "c2ccccc2)c1": 799,
      "CC(NC(=O)": 800,
      "c1ccc(O)cc1": 801,
      "CCC(N": 802,
      "C(=O)NC": 803,
      "CCCn1": 804,
      "Cc1cc2": 805,
      "c1ccncc1": 806,
      "N1CCN(": 807,
      "c5cccc": 808,
      "c2cs": 809,
      "CCOC1": 810,
      "nn2": 811,
      "(C(=O)N2": 812,
      "c2cc(": 813,
      "c3ccc(N": 814,
      "=[N+]": 815,
      "c2cccc(-": 816,
      "CCC4": 817,
      "[B": 818,
      "CCC(C)(C)": 819,
      "C([2H])": 820,
      "c2cc(F)": 821,
      "(F)F)": 822,
      "S)": 823,
      "c([N+](=O)[O-])": 824,
      "C2=O)cc1": 825,
      "c2cccc(F)": 826,
      "N(CC": 827,
      "c3ccc(Cl)cc3)": 828,
      "C(=O)C1": 829,
      "c1ccc(C(=O)": 830,
      "CCN)": 831,
      "S1": 832,
      "C(O)C(O)": 833,
      "nc4": 834,
      "CC(C)O": 835,
      "Br)cc": 836,
      "3)c1": 837,
      "C/C=C/": 838,
      "CCCC1)": 839,
      ".CC(C)(C)": 840,
      "[C@H](N": 841,
      "O=[N+]([O-])": 842,
      "C5": 843,
      "n1C": 844,
      "=N)": 845,
      "[C@@H](O)[C@H](O)": 846,
      "n2cc": 847,
      "C1=": 848,
      "Cc1cc(": 849,
      "c2C)": 850,
      "[C@@H](N)": 851,
      "C2)c1": 852,
      "c6ccc": 853,
      "o3)": 854,
      "CN2": 855,
      "O=C(NC": 856,
      "CCC(CC)": 857,
      "c%1": 858,
      "C[C@H](O)": 859,
      "O)cc1": 860,
      "(C)C2": 861,
      "n2cn": 862,
      "nc1-": 863,
      "CCNCC1": 864,
      "C(NC(=O)": 865,
      "c2ccc(F)cc2": 866,
      "(C(C)=O)": 867,
      "nc1)": 868,
      "C(=O)N(C": 869,
      "n4)": 870,
      "c2cc(C": 871,
      "c1cccc(Cl)c1": 872,
      "[C@]4": 873,
      "c2ccccn2)": 874,
      "OP(=O)(O)": 875,
      "(N)(=O)": 876,
      "c(NC": 877,
      "c1cccc(C": 878,
      "3CC3)": 879,
      "#C": 880,
      "[C@@H](CO)": 881,
      "CC#CC#": 882,
      "2)n1": 883,
      "C(C#N)": 884,
      "c2)C1": 885,
      "O[C@H](CO)": 886,
      "[C@@H](N": 887,
      "c(N2": 888,
      "S(C)(=O)=O": 889,
      "Cc1cc(N": 890,
      "3CC": 891,
      "CCCCC1)": 892,
      "CC2)CC1": 893,
      "C(N)=O": 894,
      "CC(C)C)": 895,
      "COc1cc2": 896,
      "C(=O)NC1": 897,
      "(c3ccccc3)": 898,
      "/C=C2": 899,
      "C[C@@H](": 900,
      "c2ccccc2)CC1": 901,
      "H-]": 902,
      "c1ccc2ccccc2": 903,
      "c2[nH]": 904,
      "(CC(=O)N": 905,
      ".[HH]": 906,
      "CCNC(=N": 907,
      "nc3)": 908,
      "c1nc2ccccc2": 909,
      "CC/C=C\\C/C=C\\C/C=C\\": 910,
      "2CCCCC2)": 911,
      "C[C@@H](O)": 912,
      "/C(=N": 913,
      "[C@H](C)C": 914,
      "CCCNC": 915,
      "C.": 916,
      "c3ccc(O": 917,
      "CN(CC": 918,
      "/C(C)": 919,
      "c3ccc(C)cc": 920,
      "[S+]([O-])": 921,
      "-]#[N+]": 922,
      "OCC1": 923,
      "c3s": 924,
      "=C(\\": 925,
      "+2]": 926,
      "C(N)=N": 927,
      "c3ccccc23)": 928,
      "c2cc(N": 929,
      "c2ccc(F)": 930,
      "nc2c1": 931,
      "c5ccc6": 932,
      "ccccc8": 933,
      "CC(=O)OC": 934,
      "(C(=O)OC)": 935,
      "[P": 936,
      "C(=O)N(C)": 937,
      "CCCC)": 938,
      "C#N": 939,
      "c1cc(C)": 940,
      "ccc5": 941,
      "(COC(=O)": 942,
      "c3ccccc3-": 943,
      "Cc2ccccc2": 944,
      "Cl.": 945,
      "[C@H]1CC": 946,
      "Cc1ccc(-": 947,
      "N2C(=O)": 948,
      "C4)": 949,
      "[C@H](N)": 950,
      "c(-c3ccccc3)": 951,
      "c1N": 952,
      "c2cc1": 953,
      "(CNC(=O)": 954,
      "c2nc3ccccc3": 955,
      "c6ccccc6)": 956,
      "C12": 957,
      ")cc(OC)": 958,
      "c5cc": 959,
      "c3c2": 960,
      "n1cc": 961,
      "c1c(-": 962,
      "3C)": 963,
      "CCC[C@H]1": 964,
      "CCNC(=NC": 965,
      "CC(C)(C)OC(=O)N1": 966,
      "CC.": 967,
      "C([2H])([2H])": 968,
      "3)cc2)": 969,
      "nc(N)": 970,
      "CNC1": 971,
      "S(N)(=O)": 972,
      "CCN(S(=O)(=O)": 973,
      "c2cccs2)": 974,
      "COc1ccc(N": 975,
      "3CCOCC3)": 976,
      "CCC(NC(=O)": 977,
      "OCc2ccccc2)": 978,
      "[n+]1": 979,
      "7)": 980,
      "c1cccs1": 981,
      "s2)cc1": 982,
      "n2)CC1": 983,
      "c2ccc(C)cc": 984,
      "=NC": 985,
      "COP(=O)(O)": 986,
      "C3=O)": 987,
      "c9": 988,
      "cc3)": 989,
      "CCCCN1": 990,
      "COC(=O)C1": 991,
      "[C@@H](C)C": 992,
      "C2CC2)": 993,
      "c1cc(Cl)ccc1": 994,
      "ccccc5": 995,
      "[Si](C)(C)C(C)": 996,
      "c2ccccc2Cl)": 997,
      "nc(S": 998,
      "n1cn": 999,
      "NC(": 1000,
      ")ccc1O": 1001,
      "CCCN1C(=O)": 1002,
      "c2)n1": 1003,
      "c2ccccc2F)": 1004,
      "C(=N)": 1005,
      "c1ccccc1O": 1006,
      "c1c(F)cc": 1007,
      "C(C)=O)": 1008,
      "c1cncc": 1009,
      "3CCCCC3)": 1010,
      "c4cn": 1011,
      "n2-": 1012,
      "CCOCC1)": 1013,
      "Cc1ccc2": 1014,
      "c3ccc(OC": 1015,
      "CCC(=O)O": 1016,
      "c2ccccc12)": 1017,
      "OCc1ccccc1": 1018,
      "c3nc(-": 1019,
      "cc2)cc1": 1020,
      "COc1ccc2": 1021,
      "c8ccccc8": 1022,
      "[C@@H]1CC": 1023,
      ".c1ccc(-": 1024,
      "c1c(Cl)cc": 1025,
      "c4cccc5": 1026,
      "c2o": 1027,
      "[C@@](C)": 1028,
      "Cc1cc(-": 1029,
      "c2cc3c(": 1030,
      "[C@](C)": 1031,
      "ccc2c1": 1032,
      "[C@H](C(=O)N": 1033,
      "c1cc(Cl)": 1034,
      "c4ccc5c(": 1035,
      "c1cccc(F)c1": 1036,
      "Cc1ccc(NC(=O)": 1037,
      "ccccc12": 1038,
      "(C)C)c1": 1039,
      "CCCN(C": 1040,
      "c2ccc([N+](=O)[O-]": 1041,
      "c23)": 1042,
      "=C(/": 1043,
      "c2cccnc2)": 1044,
      "CC(=O)N2": 1045,
      "C(=O)N[C@@H](C": 1046,
      "C(F)F)": 1047,
      "OC3": 1048,
      "c2ccccc21)": 1049,
      "[B]": 1050,
      ")cccc1": 1051,
      "C[C@H](": 1052,
      "CCOCCOCCOCCO": 1053,
      "c2cc(Cl)ccc2": 1054,
      "CC(F)(F)": 1055,
      "CCCCCCCC(=O)": 1056,
      "N=": 1057,
      "c2cccnc2": 1058,
      "cn1)": 1059,
      "34)": 1060,
      "N2CCCC": 1061,
      "o2)cc1": 1062,
      "n(CC": 1063,
      "CCCCCC1": 1064,
      ")cccc2": 1065,
      "c3ccccn3)": 1066,
      "C2=O": 1067,
      "=C(O)": 1068,
      "c1ccc(C(C)": 1069,
      "C1=O)": 1070,
      "c2ccc(C(=O)N": 1071,
      "O=C": 1072,
      "Cc1ccc(C)": 1073,
      "c2ccc(NC(=O)": 1074,
      "c1cccs1)": 1075,
      "c(Cl": 1076,
      "c1cccc(O": 1077,
      "CN(C)C(=O)": 1078,
      "c1ccccn1": 1079,
      "O2": 1080,
      "Cn1cc": 1081,
      "C(Cl)": 1082,
      "CC=C": 1083,
      "c3ccccc32)": 1084,
      "C1CCCC1": 1085,
      "[C@@H]5": 1086,
      "c3cccc(-": 1087,
      "cn2": 1088,
      "Sc1n": 1089,
      "C1O": 1090,
      "oc(-": 1091,
      "N1CCC(": 1092,
      "(=O)[nH]": 1093,
      "3CCCC3)": 1094,
      "CN=C(N": 1095,
      "cn2)": 1096,
      "C1CC": 1097,
      "O2)": 1098,
      "c2cc(Br)": 1099,
      "c(=O)n2": 1100,
      "COc1ccc(-": 1101,
      "c4n": 1102,
      "(N2": 1103,
      "c2c(F)cc": 1104,
      "C[C@H]3": 1105,
      "N1CCCC1": 1106,
      "Cl)cc1": 1107,
      "CN(C)C": 1108,
      ")cc5": 1109,
      "c1cccc(NC(=O)": 1110,
      "c2F)": 1111,
      "c1ncccc1": 1112,
      "C(N": 1113,
      "c2c[nH]": 1114,
      "/C=N\\": 1115,
      "C1=N": 1116,
      "3)CC1": 1117,
      "[Si](C)(C)": 1118,
      "sc2c1": 1119,
      "CC(C)(C)OC(=O)N": 1120,
      "CC[C@@H]1": 1121,
      ".Cl.Cl": 1122,
      "c2-": 1123,
      "OCc1ccccc1)": 1124,
      "/N=C\\": 1125,
      "=CCC": 1126,
      "C[C@]1": 1127,
      "C(=C)": 1128,
      ")cc(": 1129,
      "(OCC)": 1130,
      "Br)ccc1": 1131,
      "CC1(C)C": 1132,
      "c(C)c(C)": 1133,
      "c4ccc5c(c4)": 1134,
      "c1ccc([N+](=O)[O-])cc1": 1135,
      "c1cc(C)cc": 1136,
      "4CCCC": 1137,
      ")cc2)CC1": 1138,
      "CC2)n1": 1139,
      "(Br)c1": 1140,
      "C)c1": 1141,
      "CCc1ccccc1": 1142,
      "[C@@H]2O": 1143,
      "c(=S)": 1144,
      "c2ccco2)": 1145,
      ".O=C": 1146,
      "/C=C(/": 1147,
      "(CCO)": 1148,
      ".[2H]": 1149,
      "c2ccncc": 1150,
      "CC(CC(C": 1151,
      "Cc1cc(C": 1152,
      "=C(N)N)": 1153,
      "OC(C)(C)": 1154,
      "CCCN2": 1155,
      "CCOc1ccccc1": 1156,
      "C(O": 1157,
      "C1=C": 1158,
      "c2ccc3ccccc3": 1159,
      "CSc1n": 1160,
      "CC[C@H](C)": 1161,
      "CCCS": 1162,
      "/N=C/": 1163,
      ".CCCC": 1164,
      "c1ccc2c(c1)OCO": 1165,
      "CC(=O)N(": 1166,
      "c(Br)c1": 1167,
      "c1ccc(Br)": 1168,
      "C(F)(F)F)cc": 1169,
      "cccc3": 1170,
      "[Si](C)(C)C)": 1171,
      "ncn1": 1172,
      "(F)(F)F)cc1": 1173,
      "c2ccccc2)C1": 1174,
      "C(=C": 1175,
      "c1ccc(S(=O)(=O)N": 1176,
      "c1ccccc1)c1ccccc1": 1177,
      "c2cccc(C)": 1178,
      "c3ncc": 1179,
      "CC[C@H]1": 1180,
      "ccc(": 1181,
      "cc5": 1182,
      ".[HH].[HH]": 1183,
      "N1CCC": 1184,
      "c1ccc(OC)": 1185,
      "=CC1": 1186,
      "c1ccco1)": 1187,
      "NC)": 1188,
      "2CCCC2": 1189,
      "c(CN": 1190,
      ")cc2)c1": 1191,
      "3CCC": 1192,
      ")cc12": 1193,
      ".CC1": 1194,
      "CCCCNC(=O)": 1195,
      "C(=O)N[C@@H](": 1196,
      "c1o": 1197,
      "[C@H]2O": 1198,
      "CCCCN": 1199,
      "c3cc(C)": 1200,
      "C=CC1": 1201,
      "CCCCN)": 1202,
      "c2ccc(C)cc2)": 1203,
      "CC5": 1204,
      "c1cc(F)": 1205,
      "c1nc(N": 1206,
      "CCC(C)C": 1207,
      "CC/C=C\\C/C=C\\C/C=C\\C/C=C\\C/C=C\\": 1208,
      "CC2)C1": 1209,
      "Cc1cs": 1210,
      "=CC(=O)": 1211,
      "-2": 1212,
      "CC(O": 1213,
      "CCNC1": 1214,
      "c3cccc(Cl)": 1215,
      "c4cc(-": 1216,
      "n3c4ccccc4": 1217,
      "c1=O)": 1218,
      "c5ccc(-": 1219,
      "=[N-]": 1220,
      ")ccn1": 1221,
      "[C-]": 1222,
      "n2ccc": 1223,
      "COCCO": 1224,
      "c4c3": 1225,
      "c2c(-": 1226,
      "3)cc2": 1227,
      "c3cc(Cl)": 1228,
      "CC5)": 1229,
      "[nH]1)": 1230,
      "2CCCC2)": 1231,
      "c1ccc(O)cc1)": 1232,
      "OCC(O)": 1233,
      "(F)c1)": 1234,
      "c2cccc(": 1235,
      "c1ccccc1Cl": 1236,
      "c3ccc(C)cc3)": 1237,
      "c3cccs3)": 1238,
      "c4ccccc43)": 1239,
      "CCC2(": 1240,
      "CCCO)": 1241,
      "c4ccc(": 1242,
      "NN": 1243,
      "/C=C2\\": 1244,
      "(Cl)c1)": 1245,
      "NC(C)=O)": 1246,
      "CC(C)(O)": 1247,
      "c4ccc(F)cc": 1248,
      "c(Cl)c2)": 1249,
      "CCC2)": 1250,
      "c3ccncc": 1251,
      "C.C": 1252,
      "CCC(O": 1253,
      "C(=O)N[C@@H](CC": 1254,
      "2+]": 1255,
      "FC(F)(F)": 1256,
      "Cc1no": 1257,
      "C[C@@H](C": 1258,
      "O=C([O-])": 1259,
      "C(CO)": 1260,
      "c(Cl)c1)": 1261,
      "CC/C=C/": 1262,
      "cccc1": 1263,
      "OC(C)=O": 1264,
      "(C(F)(F)F)c1": 1265,
      "c1ccco1": 1266,
      "(C(=O)OC": 1267,
      "C(=O)O)cc1": 1268,
      "B(": 1269,
      "c1ccc(OC)cc1": 1270,
      "c1ccccc1F": 1271,
      "C1(": 1272,
      "Ir": 1273,
      "OC(=O)CCCCCCCC": 1274,
      "cc(C)": 1275,
      "C(F)F": 1276,
      "CCl)": 1277,
      "c6)": 1278,
      "CCCC(": 1279,
      "c2cccc(C(F)(F)F)": 1280,
      "cn3)": 1281,
      "[Si](C)(C)C(C)(C)C)": 1282,
      "c1c(C": 1283,
      ".[Cl-].[Cl-]": 1284,
      "=C3": 1285,
      "C[C@@H]3": 1286,
      "NC(=S)": 1287,
      "c(C)cc(C)": 1288,
      "c2nc(N": 1289,
      "C2)CC1": 1290,
      "[C@@]4": 1291,
      "N1CCOCC1": 1292,
      "n12": 1293,
      "c2nc(C": 1294,
      "(C(=O)OCC)": 1295,
      "(C)C(=O)": 1296,
      "C[C@@H](C)": 1297,
      "SC)": 1298,
      "CCOc1ccc(": 1299,
      "c1nc(C": 1300,
      "S(N)(=O)=O)": 1301,
      "n2)C1": 1302,
      "(=N)": 1303,
      "c(C(=O)NC": 1304,
      "c4cc5": 1305,
      "c1c(F)cccc1": 1306,
      "(=S)": 1307,
      "c1c(O)": 1308,
      "n3-": 1309,
      "[C@@H]2CC": 1310,
      "/C=C(\\C)": 1311,
      "[Si](C)(C)C": 1312,
      "n6": 1313,
      ".C=": 1314,
      "CCCO1": 1315,
      "B(O)": 1316,
      "4CCO": 1317,
      "NC2": 1318,
      "sc2": 1319,
      "c4ccccc34)": 1320,
      "O)C(O)": 1321,
      "c2c(Cl)cc": 1322,
      "C[C@H](NC(=O)": 1323,
      "=[N+]=[N-]": 1324,
      "c(F)cc": 1325,
      "N=C(N)": 1326,
      "c3ccc(Br": 1327,
      "Cc1ccc2c(c1)": 1328,
      "3)C2": 1329,
      "c1ccn": 1330,
      "nc(NC(=O)": 1331,
      "(C)C)NC(=O)": 1332,
      "c1cc2ccccc2": 1333,
      "c2ccc(Br)cc2)": 1334,
      "OC(C": 1335,
      "c(C(C)(C)C)": 1336,
      "COc1cc(C": 1337,
      "-c1ccccc1": 1338,
      ".[CH": 1339,
      "COc1ccc(NC(=O)": 1340,
      "S(=O)(=O)NC": 1341,
      "c3ccc(Cl)cc3": 1342,
      "c2nccc": 1343,
      ")cc5)": 1344,
      "COc1ccc(C2": 1345,
      "c([2H])c([2H])": 1346,
      "CCN(C)C": 1347,
      "CCO1": 1348,
      "CC1(C)c2ccccc2-": 1349,
      "c1cc(Br)": 1350,
      "C(=O)NC(C": 1351,
      "C2)C1": 1352,
      "P(=O)([O-])": 1353,
      "c1cc2c(cc1": 1354,
      "c2cccc(Cl)c2)": 1355,
      "c(-c2ccccc2)": 1356,
      "c3ncn": 1357,
      "[P+]": 1358,
      "nc21": 1359,
      "(C(C)(C)": 1360,
      "c3[nH]": 1361,
      ".O=": 1362,
      "c1cc(C(=O)N": 1363,
      "c2cc3c(cc2": 1364,
      "CC12": 1365,
      "c6cccc": 1366,
      "e]": 1367,
      "C1C": 1368,
      "c3cccnc3)": 1369,
      "c4ccc(Cl)cc": 1370,
      "c1no": 1371,
      "S(=O)(=O)O": 1372,
      "c1ccccn1)": 1373,
      "Cc1ccc(O": 1374,
      "C1CC1)": 1375,
      "c1F": 1376,
      "CCC(=O)N1": 1377,
      "[C-]#[N+]": 1378,
      "c3c(C)": 1379,
      "c4ccccc4-": 1380,
      "c3cc(F)": 1381,
      "CC(=O)N(C": 1382,
      "c1ccccc1Cl)": 1383,
      "3)C1": 1384,
      "3C": 1385,
      "[C@@H](C)C(=O)N": 1386,
      "[C@H]5": 1387,
      "c34)": 1388,
      "(C(N)=O)": 1389,
      "C2)n1": 1390,
      "c2ccc3c(c2)OCO": 1391,
      "[NH2+]": 1392,
      "CN=C(NC": 1393,
      "c2ccc(OC)cc2)": 1394,
      "c2cc(OC)": 1395,
      "c3ccco3)": 1396,
      "+3": 1397,
      "[C@H](Cc1ccccc1)": 1398,
      "c3ccccc3)cc2)": 1399,
      ".F": 1400,
      "CC[C@]4": 1401,
      "Cc1ccc(C(=O)N": 1402,
      "Nc1ccccc1": 1403,
      "CN1CCN(": 1404,
      "cnc2": 1405,
      "CCC(C(=O)N": 1406,
      "C(=O)CN(": 1407,
      "C=C(C)C(=O)O": 1408,
      "c1ccc(C(=O)O)": 1409,
      "c(F)c2)": 1410,
      "c3C)": 1411,
      "(C(=O)N1": 1412,
      "[C@@H]1C": 1413,
      "CC1=C": 1414,
      "S1(=O)": 1415,
      "3C(=O)": 1416,
      "c7ccccc7)": 1417,
      "COc1ccc(C(=O)N": 1418,
      "C(c2ccccc2)": 1419,
      "CC(C)(C)C)": 1420,
      "N)cc1": 1421,
      "CCC1)": 1422,
      "S(=O)(=O)c1ccccc1": 1423,
      "[C@@]2(C)": 1424,
      "OC(=O)CCCCCCCCCCCCCCCC": 1425,
      "].[Y": 1426,
      "COc1ccc2c(c1)": 1427,
      "c2ncccc2": 1428,
      "c4ccccc4)cc3)": 1429,
      "c1cccnc1)": 1430,
      "CCCN=C(N)N)": 1431,
      "c(O)c1": 1432,
      "3CCN": 1433,
      "c2[c-]": 1434,
      "[C@H](O)[C@H](O)": 1435,
      "CC(C)C1": 1436,
      "c3ccc(Cl)": 1437,
      "CCN(C(=O)OC(C)(C)C)": 1438,
      ".O=C(O)C(F)(F)F": 1439,
      "H+]": 1440,
      "4)cc3": 1441,
      "cnc1": 1442,
      "cc(O)": 1443,
      "c2cc(F)ccc2": 1444,
      "Cc1cc(C)cc": 1445,
      ".O=C1": 1446,
      "c3ccc(O)": 1447,
      "c6ccc7": 1448,
      "n4c5ccccc5": 1449,
      "c(Cl)c3)": 1450,
      "-].[": 1451,
      "c([N+](=O)[O-])c1": 1452,
      "c3ccccc32)cc1": 1453,
      "c2ccc(OC)": 1454,
      "C1CCCCC1)": 1455,
      "c2cccc3ccccc2": 1456,
      "2CCCCC2": 1457,
      "C(c1ccccc1)": 1458,
      "Cc1cccc(-": 1459,
      "3)C1)": 1460,
      "CC2CCCC": 1461,
      "COc1ccc(OC)": 1462,
      "c1cc2c(": 1463,
      "CC1(": 1464,
      "c3=O)": 1465,
      "c3cccc(F)": 1466,
      "N1CCN(C": 1467,
      "CCCCC)": 1468,
      "c2cc(F)cc": 1469,
      "c2cccc(Br)": 1470,
      "(c1ccccc1)c1ccccc1": 1471,
      "c1ccccc1F)": 1472,
      "%10": 1473,
      "[nH]2)": 1474,
      "[C@]2(C)": 1475,
      "c3ccccc3F)": 1476,
      "c2ccc(N(": 1477,
      "OC(C)C": 1478,
      "C(=O)[O-]": 1479,
      "c2ccc(Br)cc2": 1480,
      "=CCCC": 1481,
      "C(C)O": 1482,
      "C=CCO": 1483,
      "c(=O)n(C)": 1484,
      "c(=O)[nH]1": 1485,
      "c1ccc(S": 1486,
      "=CC2": 1487,
      "CCCCCCCC)": 1488,
      "SC1": 1489,
      "c1cccc(Cl)c1)": 1490,
      "c1cccc([N+](=O)[O-])": 1491,
      "C(=O)OCC": 1492,
      "CCN(C)C)": 1493,
      "O[C@H]1": 1494,
      "/C(=N\\": 1495,
      "c2ccccc2)n1": 1496,
      "c3ccccc3Cl)": 1497,
      "Cc1cccc2": 1498,
      ".CN": 1499,
      "[C@H](C)NC(=O)": 1500,
      "4)cc3)": 1501,
      "c1cc(O": 1502,
      "#N)cc1": 1503,
      "ccc6": 1504,
      "COCCN": 1505,
      "c1cc(Cl)cc": 1506,
      "c1c[nH]c2ccccc12)": 1507,
      "c(=O)n1": 1508,
      "NC(C": 1509,
      "nn3": 1510,
      "Pt": 1511,
      "c2c(F)cccc2": 1512,
      "c1cccc(C)c1": 1513,
      "s2)c1": 1514,
      "c1ccc2ccccc2c1": 1515,
      "on1": 1516,
      "COc1ccc(-c2n": 1517,
      "c2cncc": 1518,
      "[C@H](C(=O)O)": 1519,
      "O)c1": 1520,
      "n[nH]1": 1521,
      "CN)": 1522,
      "c3ccc4ccccc4": 1523,
      "c4cccc(-": 1524,
      ".CCC": 1525,
      "N1CCCCC1": 1526,
      "(CCCC)": 1527,
      "Br)cc1)": 1528,
      "c2c(c1)": 1529,
      "C=C/": 1530,
      "CCC2(CC1)": 1531,
      "Cc1[nH]": 1532,
      "C6": 1533,
      "N(C)C)": 1534,
      "(CC)CC": 1535,
      "C(=O)NC(": 1536,
      "Cc1nn(C)": 1537,
      "OO": 1538,
      "OC(CO)C(O)C(O)": 1539,
      "OCC[N+](C)": 1540,
      "c1cc(Br)ccc1": 1541,
      "cc12": 1542,
      "c1nc2c(": 1543,
      "C1(C)C": 1544,
      "N=C1": 1545,
      "c5c4": 1546,
      "C(F)(F)F)cc1": 1547,
      "C(C(=O)N": 1548,
      "O[C@H](C": 1549,
      ".[O": 1550,
      "c1ccc(-c2ccc(-": 1551,
      "c2cccc(F)c2)": 1552,
      ".COC(=O)": 1553,
      "n3cn": 1554,
      "CCC(=O)O)": 1555,
      "[C@H]3CC": 1556,
      "3CCN(": 1557,
      "c5cccc6": 1558,
      "c3ccc(F)cc3": 1559,
      "CCn1cc": 1560,
      "CCCNC1": 1561,
      "C2(": 1562,
      "[CH]": 1563,
      "O3)": 1564,
      "C[C@H](C)": 1565,
      "O=C(NC1": 1566,
      "[C@H]2O)": 1567,
      "OCCO2": 1568,
      "C(C)=O": 1569,
      "c4ccc(C": 1570,
      "CN1CC": 1571,
      "CCNS(=O)(=O)": 1572,
      "C=O": 1573,
      "3CC4": 1574,
      "c2cc3ccccc3": 1575,
      "C(=O)OC)": 1576,
      "CC(C)(C)OC(=O)": 1577,
      "O[C@@H]1": 1578,
      "CO1": 1579,
      "c2ccc(C)cc2": 1580,
      "/C1": 1581,
      "OC)cc1": 1582,
      "/c(": 1583,
      ".C.C.C.C": 1584,
      "nc2-": 1585,
      "[nH]c2c1": 1586,
      "ccc2-": 1587,
      "S(=O)(=O)[O-]": 1588,
      "/C=N/": 1589,
      "nnc1": 1590,
      "CC1C": 1591,
      "c2cc(C(=O)N": 1592,
      "=C(C#N)": 1593,
      "O[C@@H]2": 1594,
      "c1c(N": 1595,
      "OC(=O)CCCCCCCCCCCC": 1596,
      "4)CC3)": 1597,
      "CC(C(=O)O)": 1598,
      "C[C@@]1": 1599,
      "S(=O)(=O)[O-])": 1600,
      "c1ccc(C)cc1)": 1601,
      "c1cc(O)": 1602,
      "c2ccccc2)cc1)": 1603,
      "ncc3": 1604,
      "c3c(-": 1605,
      "c2ccncc2)": 1606,
      "/C(C#N)": 1607,
      "Cn1cn": 1608,
      "c(F)cc1": 1609,
      "c3nc4ccccc4": 1610,
      ".CC.CC.CC.CC": 1611,
      "Cc1s": 1612,
      "CCC(C(=O)O)": 1613,
      "2)ccc1": 1614,
      "c(F)c1F": 1615,
      "CC[C@@H](C)": 1616,
      "c1c(Cl)cccc1": 1617,
      "Cc1ccc(S(=O)(=O)N": 1618,
      "/C(C)=C/": 1619,
      "CCCCCCC/C=C\\": 1620,
      "C[C@H](N": 1621,
      ".[C-]#[N+]": 1622,
      "CC(C)N": 1623,
      "O=S(=O)(N": 1624,
      "CC#CC#CC#CC#": 1625,
      "[C@@H](C(=O)N": 1626,
      "c1ncc(-": 1627,
      "c2ccc(C(=O)O)": 1628,
      "+2": 1629,
      "Cn2": 1630,
      "c1cccc2c1": 1631,
      "c(SCC(=O)N": 1632,
      "[C@H](O)[C@@H](O)": 1633,
      "c1cccc(C(=O)N": 1634,
      "c1cccc(F)c1)": 1635,
      "CCl": 1636,
      "c2=O)cc1": 1637,
      "c2ccncc2": 1638,
      "K+]": 1639,
      "c3ccc(F)": 1640,
      "O=C(CO": 1641,
      "(CC2": 1642,
      "c(N)ncn": 1643,
      "c(S(=O)(=O)N": 1644,
      "NC(=O)[C@H](": 1645,
      "c2ccs": 1646,
      "n3cc": 1647,
      "c2ccc(C3": 1648,
      "c2c(C": 1649,
      "C(=O)OC(C)(C)C": 1650,
      "[n+]2": 1651,
      "CC(F)(F)F)": 1652,
      "+2].[": 1653,
      "c3ccncc3)": 1654,
      "c2Cl)": 1655,
      "N1CCN(C(=O)": 1656,
      "CCCC(=O)N": 1657,
      "c2no": 1658,
      "c2ccc(Cl)cc2Cl)": 1659,
      "1C": 1660,
      "c1ccc(Br)cc1)": 1661,
      "C2CC3": 1662,
      "c5c(": 1663,
      "Cc1ccc(-c2n": 1664,
      "C1CC2": 1665,
      "c32)": 1666,
      "c(=O)o": 1667,
      "].[Y].[Y": 1668,
      ".[Na+].[Na+]": 1669,
      "=O)c1": 1670,
      "c1ccc(C(F)(F)F)cc1": 1671,
      "c3ccc(C)": 1672,
      "N1CCCC": 1673,
      "C(=NC)": 1674,
      "c(C)n1": 1675,
      "c3o": 1676,
      "c2c(O)": 1677,
      "[C@H](OC(C)=O)": 1678,
      "C3CCCC": 1679,
      "c2cccc(N": 1680,
      "(I)": 1681,
      "Cc1nc(-": 1682,
      "c3c2)": 1683,
      "c%10": 1684,
      "COc1cc2c(cc1": 1685,
      "c3cccc(Cl)c3)": 1686,
      "[N+]1": 1687,
      "C(=O)N2C": 1688,
      "CCOc1cc(": 1689,
      "[Si](C)(C)O": 1690,
      "c2ccc(C#N": 1691,
      "c2c1)": 1692,
      "c7ccc": 1693,
      "CCN(C(=O)N": 1694,
      "c1nc(": 1695,
      "c1cccc2ccccc12": 1696,
      "c1ccccc1)C(=O)": 1697,
      "CNS(=O)(=O)": 1698,
      "CC2)ccc1": 1699,
      "c2ccc(CN": 1700,
      "c1ccc2c(c1)OCO2": 1701,
      "SCC(=O)N": 1702,
      "-2]": 1703,
      ")cc(OC)c1OC": 1704,
      "CCC3)": 1705,
      "C(=O)N(C)C": 1706,
      "c(CO": 1707,
      "c2ccc(Br)": 1708,
      "C(=O)C2": 1709,
      "(C(=O)[O-])": 1710,
      "CCOCC2)cc1": 1711,
      "3CCCCC3": 1712,
      ")cc(N": 1713,
      "O=C(O)C1": 1714,
      "CC(C(=O)N": 1715,
      "(C=O)": 1716,
      "c5ccc6c(": 1717,
      "c1ccccc1)N": 1718,
      "COCC1": 1719,
      "ccccc9": 1720,
      "C(=O)NCC": 1721,
      "S(C)(=O)=O)cc1": 1722,
      "c3ccccc23)cc1": 1723,
      "c1cccc(OC)": 1724,
      "c(Cl)cc1": 1725,
      "c1ccc(Cl)cc1Cl": 1726,
      "F)cc2)cc1": 1727,
      "C(=O)N1CC": 1728,
      "CCC(C)C)": 1729,
      "[C@H]2CC": 1730,
      "c(F)c1)": 1731,
      "4CC4)": 1732,
      "C(C)C)cc1": 1733,
      "Cc1cccc(N": 1734,
      "CC1CC1)": 1735,
      "cs1)": 1736,
      "O=c1[nH]": 1737,
      "nc(Cl)": 1738,
      "C)C1": 1739,
      "Cc1cc(F)cc": 1740,
      "Oc1ccccc1": 1741,
      ".CC(=O)": 1742,
      "NC1=O": 1743,
      "c1Cl": 1744,
      "(C1)": 1745,
      "=S=S": 1746,
      "NC(=O)C2": 1747,
      "c1cc(C(F)(F)F)cc": 1748,
      "(Cc2ccccc2)": 1749,
      "NC(C)(C)C)": 1750,
      "[C@@H](OC(C)=O)": 1751,
      "c3ccccc3)cc2": 1752,
      "c2ccc(O)cc2)": 1753,
      "[nH]3)": 1754,
      "COc1cccc2": 1755,
      "c1ccc(N(": 1756,
      "[C@@](O)": 1757,
      "3=O)": 1758,
      "/C=C1": 1759,
      "P(O)": 1760,
      "c4c3)": 1761,
      "c(C(C)C)": 1762,
      "nc1C": 1763,
      "c3cc4c(": 1764,
      "c2nnc(-": 1765,
      "4CCOCC4)": 1766,
      "c2cc(O)": 1767,
      "nn2)": 1768,
      "OCc3ccccc3)": 1769,
      ".O=S(=O)": 1770,
      "c3cc(Cl)ccc3": 1771,
      "=N1": 1772,
      "-n1": 1773,
      "(CC(=O)O)": 1774,
      "C=CC(": 1775,
      "c1c(Cl)": 1776,
      "o2)c1": 1777,
      "[C@]3(C)": 1778,
      "c1cccc(C)": 1779,
      "nc2n1": 1780,
      "OCC2": 1781,
      "COc1cccc(": 1782,
      "c3cccnc3": 1783,
      ")cc(C)": 1784,
      "c2cc(O": 1785,
      "c2ccc(S(=O)(=O)N": 1786,
      "c2cccc(O": 1787,
      "/C(=N/": 1788,
      "(CC2)": 1789,
      "3)cc2)cc1": 1790,
      "nc(C(=O)N": 1791,
      "Cc1cccc(C": 1792,
      "c1ccc(CN2": 1793,
      "(CC(C)C)": 1794,
      "CCCN2C(=O)": 1795,
      "c2ccc(C(F)(F)F)cc": 1796,
      "NC(=O)OC(C)(C)C)": 1797,
      "Cc1ccc(-n2": 1798,
      "cc(Cl)": 1799,
      "n2C": 1800,
      "CCCO1)": 1801,
      "CCNC(=O)N": 1802,
      "OC(C)(C)O": 1803,
      "Cc1cc(C(=O)N": 1804,
      "N=N": 1805,
      "c2cccc(C": 1806,
      "NC(=O)CO": 1807,
      "+3]": 1808,
      "c(F)c3)": 1809,
      "n2c3ccccc3": 1810,
      "C(OC)": 1811,
      "Cc1o": 1812,
      "CCNCC2)": 1813,
      "O[C@@H](": 1814,
      "CC1CC1": 1815,
      "CC(CO)": 1816,
      "[B])": 1817,
      "c1c(C)cc": 1818,
      "NC(=O)[C@H](C": 1819,
      "c2ccc(C(C)(C)C": 1820,
      "CCCN(C)": 1821,
      "c1ccc2[nH]": 1822,
      "4)c3": 1823,
      "c1cc(C2": 1824,
      "n(-c2ccccc2)": 1825,
      "c-]1": 1826,
      "O[C@H](CO)[C@@H](O)[C@H](O)": 1827,
      "CN2C(=O)": 1828,
      "c3cccc(C)": 1829,
      "C=C(C)C": 1830,
      ".[K+]": 1831,
      "c1co": 1832,
      "COP(=O)(O)OC": 1833,
      "cc21": 1834,
      "O=C1N": 1835,
      "=[N+]=[N-])": 1836,
      "s2)CC1": 1837,
      "cc(N": 1838,
      "nn(-": 1839,
      "oc1": 1840,
      "cccc4": 1841,
      "Cc1cc(NC(=O)": 1842,
      ".O=C(": 1843,
      "c(I)": 1844,
      "(Cl)cc(Cl)": 1845,
      "COc1cc(N": 1846,
      "ccc(N": 1847,
      "c2C)cc1": 1848,
      "c(C)cc1": 1849,
      "c2cccc([N+](=O)[O-])": 1850,
      "[C@H](OC(=O)": 1851,
      "C[C@@H](O": 1852,
      "c2ccccc2O": 1853,
      "CCCO2)": 1854,
      "c2ccc([N+](=O)[O-])cc2)": 1855,
      "COc1cc(-": 1856,
      "COC(=O)N": 1857,
      "c(CN2": 1858,
      "c2C1": 1859,
      "c1cnc[nH]": 1860,
      "(C(C)(C)C)cc": 1861,
      "c5ccc6c(c5)": 1862,
      "c1cccc(Br)c1": 1863,
      "c3ccc([N+](=O)[O-]": 1864,
      "CC3)cc2)": 1865,
      "OC(C)C)": 1866,
      "c2)ccc1": 1867,
      "CC3)cc2": 1868,
      ")cccc3": 1869,
      "c1ccc(OC)cc1)": 1870,
      "COCCN1": 1871,
      "c1nc(C)": 1872,
      "c4ccc(C)cc": 1873,
      "ccccc34)": 1874,
      "[C@]12": 1875,
      "[C@@H]3CC": 1876,
      "c1ccc(CN": 1877,
      "COc1ccc(Cl)cc1": 1878,
      "=NC(=O)": 1879,
      "C=CCn1": 1880,
      "c(C3": 1881,
      "c1ccncc1)": 1882,
      "CNC(": 1883,
      "8)": 1884,
      "[CH-]": 1885,
      "c3cccc(F)c3)": 1886,
      "P)": 1887,
      "/C=C/C(=O)N": 1888,
      "OC(C)(C)C(C)": 1889,
      "[N+](=O)[O-])cc1)": 1890,
      "C2CCCCC2)": 1891,
      "c1ccc(OCC": 1892,
      "[C@@H]6": 1893,
      "c1ccccc1)C(=O)N": 1894,
      "[C@@H](C)O)": 1895,
      "C(C(=O)O)": 1896,
      "c9ccccc9": 1897,
      "CCCC(N": 1898,
      "cn2)cc1": 1899,
      "CC(=O)N(C)": 1900,
      "(F)(F)F)cc2": 1901,
      "CC3CC(CC(C": 1902,
      "n2C)": 1903,
      "CCCCCCCCCC": 1904,
      "C(F)(F)C(F)(F)C(F)(F)C(F)(F)": 1905,
      "C21": 1906,
      "CCCCCC)": 1907,
      "c1ccc(S(=O)(=O)N2": 1908,
      "c(C(N)=O)": 1909,
      "c2n[nH]": 1910,
      "c1ccccc1NC(=O)": 1911,
      "c1cn2": 1912,
      "-c1n": 1913,
      "C[C@@H](N": 1914,
      "CCCN)": 1915,
      "=CC(": 1916,
      "CC.CC": 1917,
      "CCS(=O)(=O)C1": 1918,
      "[C@@H](OC(=O)": 1919,
      "c3ccc(OC)cc3)": 1920,
      "c3c(F)cc": 1921,
      "CC1(O)": 1922,
      "CC3CC(CC(C3)C1)": 1923,
      "Cc1ncc": 1924,
      "/C=C/C=C": 1925,
      "(C)cc(C)": 1926,
      "[C@H]1O[C@@H](": 1927,
      "O=C(C1": 1928,
      "[N+](=O)[O-])ccc1": 1929,
      "n5)": 1930,
      "c1cccc(O)": 1931,
      "CC(C)NC(=O)": 1932,
      "nc(N2": 1933,
      "[C@]12C": 1934,
      "c2cccc3c2": 1935,
      "CC(=O)OCC": 1936,
      "c2sccc2": 1937,
      "c1C)": 1938,
      "c1ccc(C(=O)O": 1939,
      "(CC)CC)": 1940,
      "2-]": 1941,
      "C2CC": 1942,
      "C(=O)OC1": 1943,
      "NC(=O)[C@H](CC": 1944,
      "(F)F": 1945,
      "c(CC)": 1946,
      "c1ccc(-c2nc(-": 1947,
      "Ir].[": 1948,
      "c2ccc(N3": 1949,
      "c2cc(-c3ccccc3)": 1950,
      "P(": 1951,
      "OCC)": 1952,
      "c1ccc(Cl)c(Cl)c1": 1953,
      "CCCl)": 1954,
      "c1ccsc1": 1955,
      "CC1(C)O": 1956,
      ".CC(C)C": 1957,
      "4)c3)": 1958,
      "[c-]c(-": 1959,
      "nc4)": 1960,
      "c2ccc(C)cc2)cc1": 1961,
      "CC1O": 1962,
      "[C@H](OC)": 1963,
      "(=O)o": 1964,
      "(C(F)(F)F)c1)": 1965,
      "C=C2": 1966,
      "Cc1ccc(F)cc1": 1967,
      "COc1cccc(-": 1968,
      "(C)C3": 1969,
      "c3ccc(C(F)(F)F)cc": 1970,
      "c4cccc5c4": 1971,
      "c2nc(C)": 1972,
      "c2ccccc2C1": 1973,
      "CCCCN1C(=O)": 1974,
      "Cc1cc(O": 1975,
      "nn(C)": 1976,
      "C=O)": 1977,
      "c3ccccc32)c1": 1978,
      "C(=O)NC(C)": 1979,
      "c2ccccc2n1": 1980,
      ")cc(C": 1981,
      "CS(=O)(=O)N": 1982,
      "c3cs": 1983,
      ".O.O": 1984,
      ")cc3)cc2)cc1": 1985,
      "c1cc(OC": 1986,
      "[C@@]12": 1987,
      "c2cc(Br)ccc2": 1988,
      "c1ccccc12": 1989,
      "nc5": 1990,
      "CC(CN)": 1991,
      "n1ccc": 1992,
      "c1ccc([N+](=O)[O-])cc1)": 1993,
      "COc1cccc(C": 1994,
      "NCCCC": 1995,
      "nc(NC": 1996,
      "C/C(=C\\": 1997,
      "C2=N": 1998,
      "CC[C@H]2": 1999,
      "c1cc(NC(=O)": 2000,
      "c2c3ccccc3": 2001,
      "OCO4)": 2002,
      "c3c4ccccc4": 2003,
      "c4ccc(N": 2004,
      "[c": 2005,
      "CCN(CC)C(=O)": 2006,
      "CCC(CN": 2007,
      "c2ccc(CC": 2008,
      "C3CC3)": 2009,
      "SS": 2010,
      "c5ccccc4": 2011,
      "CCN(CC(=O)N": 2012,
      "N1C": 2013,
      "(Cl)Cl": 2014,
      "[C@]5": 2015,
      "Cc1ccc(C2": 2016,
      "C(=O)C": 2017,
      "c1nc(N)": 2018,
      "O=C(/C=C/": 2019,
      "N#CC1": 2020,
      "+4": 2021,
      "/C=N\\NC(=O)": 2022,
      "c1cccc(C(F)(F)F)c1": 2023,
      "C(=O)OC(C)(C)C)": 2024,
      "c2ccc(Cl)cc2)cc1": 2025,
      "CCCOC(=O)": 2026,
      "C=C(C": 2027,
      "[C@H](C)C(=O)N": 2028,
      "sc3": 2029,
      "[C@H]1C": 2030,
      "c1cc(F)ccc1": 2031,
      "4CC": 2032,
      "[C@@H](C)O": 2033,
      "(C(F)(F)F)c3)": 2034,
      "CNCC1": 2035,
      "c1ccc(Cl)cc1Cl)": 2036,
      "(C)C)cc2)": 2037,
      "NC(=S)N": 2038,
      "CCN2C(=O)": 2039,
      "c5ccccc5-": 2040,
      "CCCCOC(=O)": 2041,
      "n2c1": 2042,
      "c2O)": 2043,
      "c3)cc2": 2044,
      "s4)": 2045,
      "CCC[C@@H]1": 2046,
      "c3cc(OC)": 2047,
      "[NH+]1": 2048,
      "c(F)cc2": 2049,
      "C(=O)c1ccccc1": 2050,
      "CCNC(": 2051,
      "c3ccc(N(": 2052,
      "COc1ccc(C)cc1": 2053,
      "c3cc(C": 2054,
      "C[C@@H](NC(=O)": 2055,
      "c(OCC": 2056,
      "c2cccc(OC)": 2057,
      "c(N3": 2058,
      "c(C(=O)N2": 2059,
      "34": 2060,
      "ccc12": 2061,
      "(c4ccccc4)": 2062,
      "COc1cc(C)": 2063,
      "c1ccc(C(=O)O)cc1": 2064,
      "nc2ccccc21": 2065,
      "C=CC(=O)O": 2066,
      ".CCO": 2067,
      "c2ccc3c(c2)OCO3)": 2068,
      "(Cl)cc2": 2069,
      "CCOCC2": 2070,
      "CCC[C@H]2": 2071,
      "CCCc1n": 2072,
      "nnc1-": 2073,
      "c2cc(C)ccc2": 2074,
      "c3cc(": 2075,
      "n2)n1": 2076,
      "c2ccccc2C)": 2077,
      "c3ccc(Br)cc3)": 2078,
      "c6cc": 2079,
      ".CN1": 2080,
      "OCC1c2ccccc2-": 2081,
      "N4": 2082,
      ")ccc12": 2083,
      "OCCCO": 2084,
      "(c2ccccc2)c2ccccc2)cc1": 2085,
      "Cc1ccccc1)": 2086,
      "S2": 2087,
      "Cc1cccc(": 2088,
      "c3cc2": 2089,
      "N)c1": 2090,
      "COC(": 2091,
      "c1ccc(-c2cn": 2092,
      "c4ccc(F)cc4)": 2093,
      "[C@](O)": 2094,
      "CC1CC": 2095,
      "c1cn[nH]": 2096,
      "/C(N)=N": 2097,
      ")cc6": 2098,
      "CCOC(=O)C1=C(C)": 2099,
      "c(SC": 2100,
      "NC(=O)OC(C)(C)C": 2101,
      "(F)(F)F": 2102,
      "c1cc(OC)": 2103,
      "c1ccc(N)cc1": 2104,
      "nc1N": 2105,
      "ccccc12)": 2106,
      "C2=O)c1": 2107,
      "c5cc6": 2108,
      "P(=O)(O)O)": 2109,
      "C1(C)": 2110,
      "c2c[nH]c3ccccc23)": 2111,
      "nn3)": 2112,
      "CCCCCCO": 2113,
      "C1CCN(C(=O)": 2114,
      "CC(=O)N1CC": 2115,
      "/C(O)": 2116,
      "c2c(Cl)cccc2": 2117,
      "C(=N)N)": 2118,
      "c1ccc2n": 2119,
      "cs2)": 2120,
      "nc(SC": 2121,
      "Cl.Cl": 2122,
      "c43)": 2123,
      "3+]": 2124,
      "CCCCCN": 2125,
      "CC(C)n1": 2126,
      "c1ccccc1.": 2127,
      "c1ccc(N)": 2128,
      "O[Si]": 2129,
      "[C@@H](C(=O)O)": 2130,
      "c2ccc(F)cc2)cc1": 2131,
      "c2cc(NC(=O)": 2132,
      "NC(=O)CNC(=O)": 2133,
      "CCOCCOCCO": 2134,
      "c1cccc(Br)": 2135,
      "n5-": 2136,
      "O=S(=O)(": 2137,
      "[1": 2138,
      "c1cnc(N": 2139,
      "C(Br)": 2140,
      "n4-": 2141,
      "C3)cc1": 2142,
      "n2c(": 2143,
      "c1C#N": 2144,
      "C[C@H](O": 2145,
      "[C@@]5": 2146,
      "C1=C(": 2147,
      "c1ccc(CO": 2148,
      "Cc1noc(C)c1": 2149,
      "[cH-]": 2150,
      "(C)C)cc1)": 2151,
      "c1ccccc1C": 2152,
      "CCC#N)": 2153,
      "Br)cc2": 2154,
      "COc1ccc(C(=O)": 2155,
      "C(=O)NC2": 2156,
      "CCOC)": 2157,
      "c2cc(C(F)(F)F)": 2158,
      "c(=O)n3": 2159,
      ")ccc1OC": 2160,
      "cc(Br)": 2161,
      "CCCCCCCCCCC": 2162,
      "oc5ccccc5": 2163,
      "C(=O)NC(=O)": 2164,
      "N=C2": 2165,
      "c2cccc(C(F)(F)F)c2)": 2166,
      "C5)": 2167,
      "COc1cc(OC)": 2168,
      "c(=O)n(C": 2169,
      "CCN(C)CC1": 2170,
      "c6ccc(-": 2171,
      "(C)(C)": 2172,
      "c3ccccc3)CC2)": 2173,
      "Cc1cccc(NC(=O)": 2174,
      "CCCC3": 2175,
      "c(N)c1": 2176,
      "c1nccc": 2177,
      "c4ccccc4)cc3": 2178,
      "C2O)": 2179,
      "O1)": 2180,
      "N2CC": 2181,
      "C1CCN(": 2182,
      "C(Cc1ccccc1)": 2183,
      ".Cn1": 2184,
      ".c1ccc2c(c1)": 2185,
      "c(=O)[nH]c1=O": 2186,
      "ccc32)cc1": 2187,
      "c1cnn(C)": 2188,
      "CC(C)(": 2189,
      "NC(=O)C": 2190,
      "c(Cl)cc2": 2191,
      "c1ccc(Cl)c(Cl)c1)": 2192,
      "i+]": 2193,
      "CC[C@@H]2": 2194,
      "(C1": 2195,
      "c5cc(-": 2196,
      "c1)N": 2197,
      "CC1CN": 2198,
      "cc6": 2199,
      "O=c1": 2200,
      "c2cnn(C)": 2201,
      "c1ccs": 2202,
      "C=C\\": 2203,
      "c1ccc(-n2c3ccccc3": 2204,
      "ccc23)": 2205,
      "C4=O)": 2206,
      "c1cnc[nH]1)": 2207,
      "I)cc1": 2208,
      "CCC(C2": 2209,
      "/C(=C(\\": 2210,
      "CC1=": 2211,
      "CCN(CC(=O)O)": 2212,
      "/N=C(\\": 2213,
      "CCCCC4)": 2214,
      "c1nnc(-": 2215,
      "C2(C)C": 2216,
      "[n-]": 2217,
      "-3": 2218,
      ".S": 2219,
      "Li+]": 2220,
      "c(CO)": 2221,
      "n1-c1ccccc1": 2222,
      "ncn2": 2223,
      "n5c6ccccc6": 2224,
      "c2nc3c(": 2225,
      "CCOc1ccc(N": 2226,
      "nn1)": 2227,
      "CNC(C)": 2228,
      "ccc2n1": 2229,
      "c2ccc(F)cc2F)": 2230,
      ".N#": 2231,
      "O=C(O": 2232,
      "B2": 2233,
      "/C=C2/": 2234,
